(function () {
    "use strict";

    var list = new WinJS.Binding.List();
    var groupedItems = list.createGrouped(
        function groupKeySelector(item) { return item.group.key; },
        function groupDataSelector(item) { return item.group; }
    );

    // TODO: 将数据替换为实际数据。
    // 当异步源中的数据可用时，可以添加此数据。
    generateSampleData().forEach(function (item) {
        list.push(item);
    });

    WinJS.Namespace.define("Data", {
        items: groupedItems,
        groups: groupedItems.groups,
        getItemReference: getItemReference,
        getItemsFromGroup: getItemsFromGroup,
        resolveGroupReference: resolveGroupReference,
        resolveItemReference: resolveItemReference
    });

    // 获取项的引用，以便将组键和项标题用作
    //对可轻松序列化的项的唯一引用。
    function getItemReference(item) {
        return [item.group.key, item.title];
    }

    // 此功能返回仅包含属于
    // 提供的组的项的 WinJS.Binding.List。
    function getItemsFromGroup(group) {
        return list.createFiltered(function (item) { return item.group.key === group.key; });
    }

    // 获取与提供的组键相对应的唯一组。
    function resolveGroupReference(key) {
        for (var i = 0; i < groupedItems.groups.length; i++) {
            if (groupedItems.groups.getAt(i).key === key) {
                return groupedItems.groups.getAt(i);
            }
        }
    }

    // 从提供的字符串数组中获取唯一项，此数组应包含一个
    // 组键和项标题。
    function resolveItemReference(reference) {
        for (var i = 0; i < groupedItems.length; i++) {
            var item = groupedItems.getAt(i);
            if (item.group.key === reference[0] && item.title === reference[1]) {
                return item;
            }
        }
    }

    // 返回可以添加到应用程序的
    // 数据列表中的示例数据数组。
    function generateSampleData() {
        var gd1 = "阿狸的999封情书更新至第150封~";
        var gd2 = "阿狸呓语和阿狸的漫画32篇~";
        var gd3 = "阿狸的故事集29个，带插画~";
        var gd4 = "阿狸23个小小笑话~";
        var gd5 = "阿狸的介绍~"

        var ic1 = "<p>我学会了戴着面具微笑，即使我并不开心。 我学会了天使和魔鬼的语言。 我学会了如何杀死黑森林中的巨龙。 可是......我却学不会对你的遗忘。遗忘你，是世界上最难的事情…</p>";
        var ic2 = "<p>我还在原地，傻傻的等你回来。</p>";
        var ic3 = "<p>只要身边有你，无论富贵与否，我都是世上最幸福的人。</p>";
        var ic4 = "<p>希望你说的再见，不是代表着再也不见。</p>";
        var ic5 = "<p>我，只在做一件事的时候才会想你，那就是呼吸。</p>";
        var ic6 = "<p>我想你了，可是我不能对你说，就像开满梨花的树上，永远不可能结出苹果。我想你了，可是我不能对你说，就像高挂天边的彩虹，永远无人能够触摸。我想你了，可是我不能对你说，就像火车的轨道，永远不会有轮船驶过。我想你了，可我，真的不能对你说。怕只怕，说了，对你，也是一种折磨。</p>";
        var ic7 = "<p>在心里，你是幸福的秘密；我爱你，不是说说而已。</p>";
        var ic8 = "<p>你不懂，我一天看你资料多少次。你不懂，看到你签名一换我就胡思乱想。你不懂，我上线看你不在时有多失落。你不懂，当所有人说你不适合我时，我只说了一句我喜欢。你不懂，每晚上线只为等一句晚安。你不懂，因为那是你，所以我才倍感珍惜。</p>";
        var ic9 = "<p>一生至少该有一次，为了某个人而忘了自己，不求有结果，不求同行，不求曾经拥有，甚至爱。只求在我最美的年华里，遇到你。</p>";
        var ic10 = "<p>沉默，不代表自己没话说。离开，不代表自己很潇洒。快乐，不代表自己没伤心。幸福，不代表自己没痛过。有些事，我不说，我不问，不代表我不在乎----- I want happiness, Be you give a care.我要的幸福，是你给予的在乎。</p>";
        var ic11 = "<p>如果有人问我为什么爱你，我觉得我只能如此回答：“因为是你，因为是我。”</p>";
        var ic12 = "<p>一首歌曲，会想到你；一篇文字，会想到你；一部电影，会想到你；一张侧脸，会想到你；一个笑容，会想到你；一点温暖，会想到你；才发现，一个不小心，我也变得如此脆弱。才发现，随便一个不小心就会踩到想你的雷，然后，让自己粉碎在对你的思念里 。</p>";
        var ic13 = "<p>其实，我一直都在你身后，就差你一个回头。</p>";
        var ic14 = "<p>我讲不出好听的甜言蜜语，只会像复读机一样笨拙的说我爱你，我爱你，我爱你……</p>";
        var ic15 = "<p>如果这一生我可以有999次好运，我愿意把997次都分给你，只留两次给自己：一次是遇见你，一次是永远陪你走……</p>";
        var ic16 = "<p>我知道我不坚强，但是这样的伪装我需要，因为你不在我身边。</p>";
        var ic17 = "<p>习惯难受，习惯思念，习惯等你，可是却一直没有习惯看不到你。</p>";
        var ic18 = "<p>有时候，我不是不理你，只是在等你先开口。有时候，真的好想跟你讲话，但又很怕你嫌我烦。有时候，我只是需要一个可以说话的人。有时候，我真想你能懂我，即使我什么都不说。有时候，我在乎的不是你所说的，而是那些你没有说的。</p>";
        var ic19 = "<p>我希望你幸福，因为那是我最大的心愿；我又怕你幸福，因为那样你就会忘了我。</p>";
        var ic20 = "<p>我忘了我有没有告诉过你，你是我唯一的执着，无论是现在，还是后来。</p>";
        var ic21 = "<p>你是吹进我眼里的沙子，模糊了双眼，看不清天空的样子。这一场末路繁华，不倾城，不倾国，却倾我所有。你要的是什么，一生相守，还是一晌贪欢；我要的，只是简单安稳的生活而已。爱到绝路，覆水难收。最好的幸福，是你给予的在乎。</p>";
        var ic22 = "<p>我相信我爱你。依然。始终。永远。</p>";
        var ic23 = "<p>你爱我，我会陪你；你不爱我，我给你自由。这就是傻傻的我，那个在乎你的我。</p>";
        var ic24 = "<p>我不太主动找人聊天。所以，我主动找的，都是我在乎的人....</p>";
        var ic25 = "<p>我没有很想你，只是在早上醒来时，看看有没有你发来信息和未接来电；我没有很想你，只是把你来电调成唯一的铃音；我没有很想你，只是在听歌时，被某句歌词击中，脑中出现短暂的空白；我没有很想你，只是想看看你的样子，听听你的声音；我又没有很想你，只是每次醒来时，第一个想到你。</p>";
        var ic26 = "<p>想你，是一种忧戚的美丽和甜蜜的失意。心里面，却是一股什么也代替不了的温馨。</p>";
        var ic27 = "<p>但愿有一天你会记起，我曾默默地，毫无希望地爱过你。我这扇门曾为你打开，只为你一人打开，现在，我要把它关上了。</p>";
        var ic28 = "<p>如果我不小心掉下了眼泪，一定是因为忽然想起你。</p>";
        var ic29 = "<p>今夜到明天白天有点想你，预计下午将持续想你，受延长低情绪影响，傍晚将转为大到暴想，心情由此将降低五度，预计此类天气将持续到见到你为止。</p>";
        var ic30 = "<p>以为蒙上了眼睛，就可以看不见这个世界；<br />以为捂住了耳朵，就可以听不到所有的烦恼；<br />以为脚步停了下来，心就可以不再远行；<br />以为我需要的爱情，只是一个拥抱。<br />最后我才发现，——爱一个人是贪心的，我要的不仅仅是一个拥抱，而是一颗只爱我的心。</p>";
        var ic31 = "<p>我只是需要一个不会放弃我的人......</p>";
        var ic32 = "<p>无论在世界的哪个角落，能够有你陪伴，就是一种幸福。</p>";
        var ic33 = "<p>每当闭上眼睛，你想到的会是谁呢？</p>";
        var ic34 = "<p>世界上最动人的承诺，不是 我爱你，而是在你需要的时候，我说：l be there。</p>";
        var ic35 = "<p>我能想到最甜蜜的事，就是在喜欢你的每一天里，被你喜欢。</p>";
        var ic36 = "<p>以后的路还那么长，我不知道结局，也不做假设。我只想看见生命最完整的样子。我不想记得那句难过的话。我只记得一件事。 在你身边，在你身边 。</p>";
        var ic37 = "<p>我以为只要很认真地喜欢，就可以打动一个人。却原来，我只打动了我自己。</p>";
        var ic38 = "<p>我想要的并不多，只想你爱着我，或者，请你记得我爱你就好...</p>";
        var ic39 = "<p>如果你能解释为什么会喜欢一个人，那么这不是爱情，真正的爱情没有原因，我爱你，不知道为什么...</p>";
        var ic40 = "<p>可能我只是你生命里的一个过客，但你不会遇见第二个我...</p>";
        var ic41 = "<p>一个人的时候，总怀念着过去，怀念过去的你和过去的自己。总是这样想着想着，心就暖了，然后又想着想着，心就酸了…总有些时候，读到一篇文字，读着读着，眼眶就红了…生命里也总有一种偶然，偶然听到一首歌，听着听着，眼泪就不小心掉了…其实，生活也没有什么不顺心，我只是…突然想你了。</p>";
        var ic42 = "<p>你忽略我的时候我觉得全世界都忽略了我，你在乎我的时候，我却忍不住，忽略了全世界……</p>";
        var ic43 = "<p>我希望，给你的爱，总是刚刚好……<br />不超出你的承受、也不激起你的排异…</p>";
        var ic44 = "<p>任百花无数，我只摘一朵；<br />任弱水三千，我只取一瓢；<br />任群芳百艳，我只在乎你；<br />任万夫所指，我只守护你。</p>";
        var ic45 = "<p>有时候，我会好想拨通你的电话，只是想告诉你，我没有忘记你。<br />有时候，我会好想紧紧的抱一抱你，那是因为难过，害怕永远不再有你~<br />我是个胆小的孩子~<br />紧张着你的一切~</p>";
        var ic46 = "<p>这个世界除了你，再不会有人让我这样坚定到失控…<br />这个世界除了你，再不会有人让我这样坚定到失眠…<br />只是~很在乎你~</p>";
        var ic47 = "<p>像我这么懒的人，要是你说的每一句话我都有回，那就说明我喜欢你啊~<br />像我这么懒的人，要是我说的每句话你都不回，我还坚定的给你发着，那就说明，我爱你！<br />自作孽</p>";
        var ic48 = "<p>不要把我的关心当成理所应当，不管我多爱你，最终也会有疲倦的一天...<br />要么，在我爱你的时候，呼应我，让我感觉到的到，哪怕一点点的肯定。<br />要么，等我不爱你了，不要看着我的光辉而后悔。<br />不要因为我不帅，不要因为我现在的平凡而忽视我对你的珍视；好么。<br />如果，有一天，我累了。<br />也许，我会从你的身边静静的走开。<br />直到你再也看不到我。<br />然后，蹲下。<br />为我这一段没有结局，莫名开始的感情，莫名的心悸，立下一个小坟堆，然后站起来，继续坚强的走下去。</p>";
        var ic49 = "<p>我爱你、所以我给了你伤害我的权利、只要我能忍受、我会一直陪伴着你。<br />可不可以；不要伤害我太多；<br />冷了；会淡漠。<br />痛了；会松手。<br />喜欢你的呼吸；珍惜你的存在；小心翼翼的保护着你。<br />而我要的；只是你的一个眼神。</p>";
        var ic50 = "<p>If you are not here , to whom is my happiness gonna show ?<br />如果你不在我身旁，那么，我要幸福给谁看？<br />如果，你不在我身旁，我怎么会幸福。</p>";
        var ic51 = "<p>You`re more than a shadow , i`ve just to believe.<br />我坚信、你不会只是我生命中的一个过客。</p>";
        var ic52 = "<p>没有电话；没有问候；没有按时赴约；你太忙；我明白。<br />如果有一天我不爱你了；轮到你明白了。<br />我独自走在寂寞的长街；<br />我告诉自己勇敢去面对；<br />如果情依旧梦能圆；<br />泪水化作雨下满天。</p>";
        var ic53 = "<p>对于整个世界而言，你是一个人；<br />但对于某个人而言，你是他的整个世界。</p>";
        var ic54 = "<p>You are the one , in particular , I care ,I treasure.<br />我最在乎的人；最重视的人；最特别的人；最珍惜的人；都是你。<br />我的在乎；我的重视；我的珍惜；只是想让你能成为我唯一的；特别的那个人。<br />你懂么。。。。</p>";
        var ic55 = "<p>Your name is such ordinary but it affects my mood all round.<br />你那么平凡的名字；却影响我那么多的情绪。<br />看到这篇，你想到了谁， 出来吧。。。。</p>";
        var ic56 = "<p>我不生气、因为身体是自己的。<br />我不伤心、因为心是你的。</p>";
        var ic57 = "<p>不是因为我执着，而是因为你值得。</p>";
        var ic58 = "<p>我没法承诺能给你太多东西，因为未来不确定，因为我们不确定。<br />但我会告诉你，我不许你哭。</p>";
        var ic59 = "<p>我喜欢你，不是因为你是怎么样的一个人，而是因为我喜欢与你在一起时的感觉。</p>";
        var ic60 = "<p>我爱你，不光是因为你的样子；<br />还因为，和你在一起时，我的样子。<br />我爱你，不光因为你为我而做的事；<br />还因为，为了你，我能做成的事。<br />我爱你，因为你能唤出，我最真的那部分，我的傻气  我的弱点，在你的目光里几乎不存在；<br />我心里最美丽的地方，被你的光芒照的通亮。<br />这里，我的胸口。<br />这里，我的心脏。<br />这里，留给你。<br />一直，都是你的。从我没遇见你之前直到到以后。</p>";
        var ic61 = "<p>Dear，我很想告诉你，其实我一直都在你的身边，只是你没发现。</p>";
        var ic62 = "<p>吃醋是因为喜欢你，生气是因为在乎你，发呆是因为想念你，伤心是因为不想失去你……<br />我真的。很在乎你。。。<br />只是，不知道怎么说出来。。不知道怎么做才对。。。<br />也许，我老了吧。。</p>";
        var ic63 = "<p>在没遇到你之前，我怎么也想象不出，自己会这么深刻的去爱一个人。<br />和你在一起后，也从不敢想象没有你的世界会是怎样。<br />我只知道，此刻的我比谁都幸福，因为有你。</p>";
        var ic64 = "<p>我能想到最甜蜜的事，就是在喜欢你的每一天里，被你喜欢。</p>";
        var ic65 = "<p>看看我的眼睛，你会发现你对我而言象征着什么。</p>";
        var ic66 = "<p>最怕的是满心欢喜的跟你说了心里话，你回复的却是最简单的一个：哦</p>";
        var ic67 = "<p>当我向你倾诉我烦恼，那不是抱怨，那是我对你的信任……<br />我这辈子，也就信任那么几个人，而我最信任的，是你。</p>";
        var ic68 = "<p>通往幸福只需要四步：你、我、我们的心、在一起。</p>";
        var ic69 = "<p>如果我的未来有你在，那其他的什么我都不怕了。<br />做我的公主好么，给你，最好的最幸福的城堡。</p>";
        var ic70 = "<p>我的幸福，就是和你温暖的过一辈子。<br />时间停止,是因为时针爱上了分针,再也不想分开,就如同,我,爱上,你…即便钟楼变成废墟，也要一同面对今后的时光…</p>";
        var ic71 = "<p>每天早上看到你和阳光都在就是我想要的未来。</p>";
        var ic72 = "<p>很多时候，我只是想能有个你，紧紧抱着我不放，直到我的心情真的好起来。</p>";
        var ic73 = "<p>我多希望你能明白我，即使我什么也不说。</p>";
        var ic74 = "<p>再累，再苦，再疼，也只是为了你能喜欢我而已。</p>";
        var ic75 = "<p>我们要做的，就是拉着彼此的手走到最后，其他的，交给命运。</p>";
        var ic76 = "<p>为你写的心情，为你改的签名，为你设定的隐身可见...<br />这些你会知道么？<br />我希望能通过我的一点动作，让你懂得我的心。</p>";
        var ic77 = "<p>对我来说，最难忘的日子，是有你陪伴的时光。</p>";
        var ic78 = "<p>孤单不是与生俱来的，而是由我爱上你的那一刻开始的。<br />我真的，很想你…<br />很想你…</p>";
        var ic79 = "<p>我不需要那个人有多完美，我只需要你能让我感觉到我就是你。</p>";
        var ic80 = "<p>知道也许最后我们不会在一起，可我还是想把什么美好都给你。</p>";
        var ic81 = "<p>什么海枯石烂，什么下辈子，什么永远，我都不要，我只要每个下一秒你还在我身边。</p>";
        var ic82 = "<p>你只需要知道，我是你最好的依靠。</p>";
        var ic83 = "<p>你看，这么多人，这么大的世界，我遇到了你，你也遇到了我，真好。</p>";
        var ic84 = "<p>你是我晚上睡觉前最想聊天的人，我爱这种感觉。</p>";
        var ic85 = "<p>我忘了我有没有告诉过你，你是我唯一是执着，无论是现在，还是后来。</p>";
        var ic86 = "<p>我会一直等着你，知道没有再等下去的理由。</p>";
        var ic87 = "<p>我很想知道，当我的名字滑过你的耳朵，你脑海里会闪现什么？</p>";
        var ic88 = "<p>不是对谁我都会说晚安</p>";
        var ic89 = "<p>我掏出心脏，想把你的名字从心里抹去。<br />可我发现你根本不在我心里。<br />我努力掏空自己，原来发现，我已爱你爱到骨子里。</p>";
        var ic90 = "<p>你不在，我也过得很好，可是这不代表你不重要。</p>";
        var ic91 = "<p>有些玩笑，开着开着，就认真了。<br />比如，我喜欢你。</p>";
        var ic92 = "<p>你竟然不喜欢我………………<br />这是病，很严重，得治，一定要治！！</p>";
        var ic93 = "<p>如果你喜欢我，就告诉我，因为我不可能永远等你~</p>";
        var ic94 = "<p>我给你时间是让你看清对我的感情；<br />我给你选择是让你给我个理由坚持。</p>";
        var ic95 = "<p>世界上最动人的承诺，不是“我爱你”，而是在你需要的时候，我说“I'll be there”</p>";
        var ic96 = "<p>所有的理由，就只为一个心动。</p>";
        var ic97 = "<p>我莫名其妙的笑了，只因为想到了你。</p>";
        var ic98 = "<p>你是不是和我一样，庆幸微博没有【最近访客】这一栏，因为我几时几分系那个你，和我一天想你多少遍，都是秘密。</p>";
        var ic99 = "<p>虽然爱情会褪色，就像老照片，不过我知道，你会在我心中永远美丽。</p>";
        var ic100 = "<p>我没有停止爱你，我只是决定不再表现出来。</p>";
        var ic101 = "<p>有些话，你不经意的说出口，我却很认真的难过。</p>";
        var ic102 = "<p>我不吵不闹，不联系不打扰，你过你的生活就好，安静的住在我心里就好。</p>";
        var ic103 = "<p>常常一个人翻我们的聊天记录，看着看着就笑了，看着看着就哭了。</p>";
        var ic104 = "<p>世界上最痛苦的话是：“我爱你，但是我不能跟你在一起。”世界上最甜蜜的话是：“虽然我们今生无法在一起相扶到老，但我会依然爱着你。</p>";
        var ic105 = "<p>我去过世界上很多地方，看了很多风景；可是，我最想去的地方，是你心里。</p>";
        var ic106 = "<p>我知道现在的你需要一个拥抱，我给你。无关友情，无关爱情，无关心态，无关状态，无关希望，无关失望，无关信念，无关信仰，我只是想告诉你，你，不是一个人。</p>";
        var ic107 = "<p>你不是最好的，却是我最珍惜的。</p>";
        var ic108 = "<p>如果我死了。你在街口突然又看到安然无恙的我，你会吓得转头跑掉，还是会飞跑过来紧紧抱住我。</p>";
        var ic109 = "<p>无论你在哪里，在谁身边，我永远是那个最牵挂你的笨蛋。</p>";
        var ic110 = "<p>我曾给过你闭上眼睛捂起耳朵的信任，就算全世界都说你有错，只要你否认，我就相信。</p>";
        var ic111 = "<p>我没有很想你，我只是在不想想你的时候才想你…</p>";
        var ic112 = "<p>你若属于我，那就只属于我一个人，我可不喜欢和别人分享…</p>";
        var ic113 = "<p>给我神奇的魔法，为你掀开眼前乌云的帘，看见碧海蓝天 </p>";
        var ic114 = "<p>或许，不该再跟那些过去过不去...我该感谢，遇见了你</p>";
        var ic115 = "<p>我不知道，下一辈子是否还能遇见你，所以我今生才会，那麼努力把最好的都给你。</p>";
        var ic116 = "<p>有时候，我想消失一下，然后看看是否会有人想念我。</p>";
        var ic117 = "<p>有没有发现，即使你在线，我也没找你了，不是我不在乎你，是因为，我发现你不需要我了。</p>";
        var ic118 = "<p>喜欢你的人很多，不缺我一个。我喜欢的人很少，除你就没了</p>";
        var ic119 = "<p>我，不会问不会提，难过了就一个人不停地走。我，不会吵不会闹，心痛了用沉默代替一切。我，不会哭不会笑，累了我就会消失一下。我知道，每条路都很难走，我知道，我不可以强求任何人。我只是希望在我抱怨上天吝啬的时候，有个人可以对我说，别太在意，我心疼你</p>";
        var ic120 = "<p>我设想着有你陪伴的幸福日子；我设想着有你照顾的温馨生活；我设想着有你笑声的每个角落； 我设想着只属于我们俩的代号，我想你....</p>";
        var ic121 = "<p>一百句如果爱，都不及一句在一起来的实在。</p>";
        var ic122 = "<p>不管你是否爱着我，我能傻傻的爱着你，就是一种幸福。</p>";
        var ic123 = "<p>总有一天你会知道：公交5分钟一班；地铁10分钟一班；我们的爱，一辈子只有这一班....</p>";
        var ic124 = "<p>我爱你，没有什么目的。<br />只是爱你。<br />一辈子，就做一次自己。<br />这一次，我想给你全世界。<br />这一次，遍体鳞伤也没关系。<br />这一次，用尽所有的勇敢。<br />这一次，可以什么都不在乎。<br />但只是这一次就够了。<br />因为生命再也承受不起这么重的爱情。<br />愿意为你丢弃自尊，放下尊严，不管值不值，不管有多卑微。</p>";
        var ic125 = "<p>Whatever I may be , Whatever I may becomming this world .....<br /> I will always look out for you , Tyrande .....<br />无论我做了什么，无论我变成什么样子，我会永远关心你的。</p>";
        var ic126 = "<p>你知道思念你的滋味么？就像喝了一大杯冰水，然后用很长很长的时间流成热泪。</p>";
        var ic127 = "<p>不管别人怎么看我，怎么说我。<br />我都可以为你付出我的一切，包括我的尊严…</p>";
        var ic128 = "<p>刚刚好，看到你幸福的样子，于是，幸福着你的幸福…</p>";
        var ic129 = "<p>有的人，每天和你争吵，却不曾怪罪你。<br />有的人，连争吵都没有，却已经消失在人海。<br />原来，冷漠比争吵更可怕。。</p>";
        var ic130 = "<p>因为不知道傻辈子是否还能遇见你，所以我今生才会那么努力把最好的给你。。<br />只是，太爱你。。</p>";
        var ic131 = "<p>每个季节，我都想和你牵手走过。</p>";
        var ic132 = "<p>当时，把你下载到我心里，而现在，她告诉我：“此文件已无法删除”</p>";
        var ic133 = "<p>真正的爱情，不是一见钟情，而是日久生情；<br />真正的缘分，不是上天安排，二十你的主动；<br />真正的关心，不是你认为好的就要求她改变，而是她的改变你是第一个发现的；<br />真正的遗忘，不是把一切关于她的东西都砸碎，而是心里真正的放下她；<br />真正的永恒，不是她时刻在你身边，而是她一直在你心里…<br /><br />你存在，我深深的脑海里，我的梦里，我的心里，我的歌声里。。。</p>";
        var ic134 = "<p>始终都相信，即便是隔着一片时间的海，我也可以飞过它，与你相见。</p>";
        var ic135 = "<p>时间停止是因为时针爱上了分针，再也不想分开，就如同，我，爱上，你…</p>";
        var ic136 = "<p>爱情是一朵花，而你，是唯一的种子…</p>";
        var ic137 = "<p>很奇妙的一种感觉是，曾经的陌生人，突然之间成为了你的整个世界。</p>";
        var ic138 = "<p>往往别人对你好，并不是你很讨人喜欢，而是你傻的让人心疼。</p>";
        var ic139 = "<p>你问我爱你值不值得，其实你应该知道，爱就是不问值不值得。</p>";
        var ic140 = "<p>我藏不住秘密，也藏不住悲伤，正如我藏不住爱你的喜悦，藏不住分离时的彷徨。<br />我就是这样坦然，你舍得伤，就伤。</p>";
        var ic141 = "<p>坐在你的身边已经很有满足感，看你看的画面，过你过的时间；</p>";
        var ic142 = "<p>我想，等我毕业了，心里的那个人还会是你。<br />我想，等我该结婚了，第一个想到的，就会是你。</p>";
        var ic143 = "<p>我最珍惜的，就是你送我的东西，每当看见它们，我就会笑的像个小孩子。</p>";
        var ic144 = "<p>以前我一直觉得对爱情还是不要太认真的好，不然会伤的太重，但是遇见你之后，什么伤不伤的都不重要了，我只想用所有来爱你。</p>";
        var ic145 = "<p>或许，不该在跟那些过去过不去…我该感谢，遇见了你。</p>";
        var ic146 = "<p>爱，从来不是件简单的小事，得经得起不爱，经得起离开，经得起等待。<br />若你相信，你就是我的终点。</p>";
        var ic147 = "<p>思念是最重的行囊，我带着它不能离去；<br />所以我会一直在这里等你，等你带走我的行李，伴我远行。</p>";
        var ic148 = "<p>我不需要你有多完美…<br />我只是需要你能让我感觉到，我，就是你的那个唯一…</p>";
        var ic149 = "<p>弱国一个人真的足够在乎你，那么他总能挤出时间来陪你，没有借口，没有谎言，没有不兑现的诺言。</p>";
        var ic150 = "<p>当我们第一次相见，我并没有想到你对我如此重要。</p>";

        var icc1 = "<p>孤单是两个人相遇之前的约定。——Hans </p>";
        var icc2 = "<p>影子：“阿狸怎么了？”<br />大熊：“受到了前所未有的打击。”<br />影子：“什么打击？”<br />大熊：“他一直以为桃子对他说的是 爱你，今天才知道人家说的其实是 矮狸 。”<br />影子：“....”<br /></p>";
        var icc3 = "<p>下午时候，阿狸和大熊、影子一起打牌，<br />到了决一胜负的关键时刻！ <br />阿狸诚心祈祷说：“请万能的神赐予我一张好牌吧！！！” <br />结果打开的下一张牌，上面写着：“好牌！”</p>";
        var icc4 = "<p>大熊对阿狸说：我最近在学魔方，好难啊！<br />阿狸：对我来说很简单啊，你看我给你表演，看！成功了！！<br />大熊：...毛啊！你的魔方为什么每个面就四个小方块啊！<br />四个方块也就罢了！但为什么魔方就一个颜色啊！！！<br /></p>";
        var icc5 = "<p>看完了《地心旅行记》之后，<br />阿狸决定要去很远的地方旅行！<br />结果他走过了几个街区，买了一个甜筒就回来了...<br /></p>";
        var icc6 = "<p>阿狸和伙伴们春游结果在翡翠森林里迷路了。 <br />“米卡！！旅行之前让你带个地图，结果你带了个地球仪有个P用啊！！”</p>";
        var icc7 = "<p>“打劫！！全部说出你们的宝藏藏在哪里！！”<br />“......”<br />“喂！！！你们四个现在装自闭症有点晚了吧！！”</p>";
        var icc8 = "<p>阿狸：“我便是行侠仗义的佐罗！！看我的剑刷刷刷……”<br />路人们：“看啊看啊，有一只刷贱的狐狸！！”<br />阿狸：“……”</p>";
        var icc9 = "<p>阿狸在看书桃子在放空，桃子忽然哭了。 <br />阿狸问为什么，桃子说刚才我在乱想， <br />要是有一天你不在我身边了，我会有多难过 <br />...然后就流下泪来... </p>";
        var icc10 = "<p>“你好！大布雷.斯科特.比斯雷德.阿布西科尔亚.阿尔比克熊！” <br />“闭嘴用腹语说也不行！！！！！”<br /></p>";
        var icc11 = "<p>“哇哈哈哈哈，大熊我在档案馆里查到你的全名了，哈哈哈” <br />“不要说！闭嘴！” <br />“哈哈哈，原来你的全名大布雷.斯科特.比斯雷德.阿布西科尔亚.阿尔比克熊！ <br />简称：大熊！笑死我了哇哈哈哈！！” <br />“闭嘴闭嘴闭嘴！！！” </p>";
        var icc12 = "<p>“孩子你要知道，人的眼睛看不到耳朵， <br />这就告诉了我们，靠眼睛看世界是不够的，还要用心去倾听。”教授matt说 <br />“教授教授，你看你看！！” <br />“.....”<br /></p>";
        var icc13 = "<p>“阿狸，想不想吃草莓？” <br />“想！” <br />“那你自己去洗下。” <br />“那不吃了。” <br />“.....”</p>";
        var icc14 = "<p>吃过鸡肉卷的有没有！！ <br />吃过鸡肉卷的有没有！！ <br />吃过鸡肉卷的有没有！！ <br />这个可以有！ <br />这个真的有！ <br />这个经常有！ <br />喜欢吃鸡肉卷的孩子上辈子都是折翼的天使啊！！！ <br />想天天吃顿顿吃各种做法鸡肉卷的有没有！！！ <br />有没有！！有没有！！ <br />喜欢吃鸡肉卷的孩子你们伤不起！！！！<br />“影子，阿狸怎么了？” <br />“没什么...他要提议午餐便当增加鸡肉卷，所以正在练习演讲。”<br /></p>";
        var icc15 = "<p>“我刚才叫的是苹果啊，可是你是梨啊？”阿狸问 <br />“我就是一个叫梨的苹果啊~” <br />“....”</p>";
        var icc16 = "<p>如果我是一只刺猬，你还会拥抱我吗？<br /></p>";
        var icc17 = "<p>人似乎总记得当时自己有过不开心，却忘记了因为什么 </p>";
        var icc18 = "<p>阿狸爸爸在洗碗的时候说：当时我和你表白的时候，你的回答让我很开心。<br />阿狸妈妈：“哎？我回答什么了。”<br />阿狸爸爸：“我问你，你爱我吗？你回答说爱啊。”<br />阿狸妈妈：“啊，我没有听到你问我啊，我当时说的是哎呀。”<br />阿狸爸爸：“...”</p>";
        var icc19 = "<p>阿狸妈妈教给大家削苹果， <br />桃子削的最好，就好像是天生就没有皮的苹果。 <br />大熊削的也不错，只是棱角分明了一些， <br />影子直接的六刀削完.. <br />而阿狸的...已经早被他吃掉了...</p>";
        var icc20 = "<p>阿狸帮着做登记， <br />“你好，我叫妍。” <br />“好的!写完啦~” <br />“对不起...你少写一个撇....” <br />阿狸“...”</p>";
        var icc21 = "<p>兔子米卡对阿狸大熊说：“我给你们变个魔术吧！”<br />米卡突然掀起礼帽上的魔术手巾,<br />“看！还会动的幸运兔脚！！”<br />“这是你自己的脚吧”阿狸说...</p>";
        var icc22 = "<p>灯神：“是你召唤我出来的？我可以满足你三个愿望,你要感谢我。” <br />阿狸：“满足我的愿望也是你的愿望啊，你也要感谢我的~” <br />灯神：“.....”<br /></p>";
        var icc23 = "<p>阿狸和兔子合影，拍照的影子说说~靠！！ <br />接着影子又说：靠近点... <br /></p>";
        var icc24 = "<p>“我说你短手短腿的救不了高塔上的公主吧！” <br />“....”<br /></p>";
        var icc25 = "<p>星期天的下午，阿狸和大熊在咖啡馆里。<br />大熊：阿狸快看！兔子兔子！ <br />阿狸：大惊小怪，兔子有啥好看的 <br />大熊：阿狸快看！兔子兔子！ <br />阿狸：不想看~ <br />大熊：阿狸快看！兔子兔子！ <br />阿狸：好烦啊，在哪里我看看<br />阿狸一抬头，就看到一只秃子兔子跑了过去...</p>";
        var icc26 = "<p>阿狸妈妈和爸爸在结婚前曾经分开两地， <br />阿狸爸爸在写给妈妈的信里有一句话：<br />我和你在两岸，但都要相信河终有尽头。<br /></p>";
        var icc27 = "<p>“先生，请您买一根火柴吧！” <br />“喂！我们这是加油站！！！你有多少我们都买！你卖了赶紧走！！”<br />事后阿狸对大熊说：我说对吧，卖火柴的小姑娘的这个故事写得不真实！<br /></p>";
        var icc28 = "<p>“你好，请问让人鱼公主的鱼尾变成双腿的药水，是您配的吗？” <br />“是的，你找我有什么事情吗” <br />“是这样，能不能给我一些药水？” <br />“怎么？你也遇到了人鱼公主的遭遇？” <br />“没有，我想吃虾的时候蘸着吃，这样就能吃到两条虾尾巴了..” <br />“….”<br /></p>";
        var icc29 = "<p>阿狸参加巫师级别考试，<br />其中有一题要测色盲。<br />阿狸问：为啥要测这个！色盲和魔法有关系吗？<br />考官魔法师说：自从有一个巫师吃掉了准备送给白雪公主的苹果后，<br />就增加了这个考题。<br />阿狸：......</p>";
        var icc30 = "<p>记者：“请问你面对手持手枪的凶猛矮人，是如何克服恐惧营救人质的呢？” <br />阿狸：“什么！那个矮人还拿着手枪？” <br />记者：“......”<br /></p>";
        var icc31 = "<p>王子：“阿狸，今天我开了一天的圆桌会议，失声了，你去请医生来。”<br />阿狸：“医生！王子失身了！医生！王子失身了！请速来宫殿！”<br />王子：“阿狸！！！！！”<br /></p>";
        var icc32 = "<p>“阿狸，你说如果我被大魔王捉住了，你会不会成为理想中的骑士，骑白马去救我？” <br />“不会啊，我的理想是做大魔王，这样可以抓公主。” <br /> 啪！<br /></p>";

        var iccc1 = "<p>你会是温暖的，<br />不舍的，<br />安静的，<br />像太阳一样的吗？<br />就像现在。</p>";
        var iccc2 = "<p>周末和大熊、趴趴去吃火锅，<br />阿狸不喜欢香菜，于是拿着筷子一点一点的把香菜从调料里面捡出来。<br />一根香菜，<br />两根香菜，<br />三根香菜...<br />四根香菜...就这样强迫症样的捡了十分钟。<br />“终于捡完啦！”阿狸大声说，<br />拿筷子一翻碗里的调料，<br />结果发现调料下面有更多的香菜...<br />....<br /> 当时是有点崩溃了...<br /></p>";
        var iccc3 = "<p>阿狸：“早上老师弗洛伊德.萨讲支点的原理，<br />让我们来做类似的实验，<br />我就对老师说给我一个豌豆我就能撑起宇宙！！！”<br />大熊：“然后呢？” <br />阿狸：“看我的脸，(￣ε(#￣) 。”</p>";
        var iccc4 = "<p>阿狸咖啡店&糖果店在青岛中京路的716号，<br />旁边是SWAMPLEG面包房和鲜花店，<br />你可以坐K21路路巴士车或骑单车过来，<br />出门左拐步行大概十分钟会看到蓝色的大海，<br />如果你是下雨天来的话，咖啡店会提供阿狸红色的雨伞。<br />咖啡店不提供酒精饮料，不提供悲伤和宿醉。<br />每天十一点四十五分打烊，除非特殊情况。<br />靠窗能看到大海的位置建议你提前电话。<br />只有第五号的双人座位不接受预定，<br />因为是我和你的位置。<br />四月一号，愚人也好，童话也罢。<br />我想总有一天会实现。</p>";
        var iccc5 = "<p>阿狸学着妈妈的办法做馅饼，结果做失败了，意外的是失败的馅饼反而更好吃。<br />所以阿狸今后只做失败的馅饼。<br />所以阿狸在想失败和成功到底有什么区别呢....<br /></p>";
        var iccc6 = "<p>我很想有那种魔法的邮箱，<br />可以把我像信一样邮寄给你。</p>";
        var iccc7 = "<p>语法课上，咖啡.D博士布置了“我想....”的作文。<br />阿狸酝酿了很久，就开始写：<br />“<br />我想想想想想想想想想想想想想想<br />想想想想想想想想想想想想想想想<br />想想想想想想想想想想想想想想想<br />想想想想想想想想想想想想想想想<br />想想想想想想想想想想想想想想想<br />想想想想想想想想想想想想想想想<br />我想想想想想想想想想想想想想想<br />想想想想想想想想想想想想想想想<br />想想想想想想想想想想想想想想想<br />想想想想想想想想想想想想想想想<br />想想想想想想想想想想想想想想想<br />想想想想想想想想想想想想想想想<br />我想想想想想想想想想想想想想想<br />想想想想想想想想想想想想想想想<br />想想想想想想想想想想想想想想想<br />想想想想想想想想想想想想......你<br />。”</p>";
        var iccc8 = "<p>阿狸下午对大熊说：我会像vitas那种海豚音呢！！！大熊说那你唱给我听下。<br />阿狸唱了半天之后，大熊说好像是踩到鸡脖子后听到的声音。好冷啊...<br />冬天过去了，还是好冷啊。。。</p>";
        var iccc9 = "<p>阿狸一直安静的站在樱花树下 浣熊说阿狸是在被罚站，兔子说阿狸是在看树上的蚂蚁，麻雀说阿狸是打赌赌输了，羊羊讲阿狸是为了准备写诗歌酝酿情绪， 其实 阿狸只是安静的等有樱花落下时来判断今天的风向….  有一些简单的幸福是不是我们想象太复杂？</p>";
        var iccc10 = "<p>大熊和阿狸在作文课上，阿狸：老师要求写我们的擅长啥...这个咋写..大熊：很简单啊，就写比如画画，唱歌啥的就好了啊。阿狸：可是你说的这些我都很差...大熊：那你就写你最擅长的好了。于是，大熊看到阿狸认真的在作业本上写上：很会过马路。大熊：.....<br />------------------------------------------<br />其实每天阿狸放学都是这样的...<br />“我好像看到突然一块红色的东西迅速通过我车前.....是我的错觉吗？？”经常有司机这样说。</p>";
        var iccc11 = "<p>阿狸自从看了阿花的书《远方孤独的狼》<br />决定一个人去远方。<br />他的行李很简单。<br />陪伴他长大的玩偶熊。<br />来的雪白羽毛和一颗枯掉的狗尾巴草。<br />一个蓝色的瓶子，他把秘密说给它听。<br />可是，远方究竟是哪里呢？<br />阿狸问妈妈。<br />妈妈却说，<br />你不是狼，只是一个小小的狐狸。<br />而到不了的地方，才是远方。</p>";
        var iccc12 = "<p>看不到你的笑要我怎么睡得着。</p>";
        var iccc13 = "<p>果夏天的阳光可以储存到冬天的房间里用，那该有多好。<br />刚刚完成的一页插图，和故事情节有关系才画了很多可爱的兔子。和其他形象没有关系哈！新书每一页都很花费了很多时间，希望能早日完成。<br /></p>";
        var iccc14 = "<p>阿狸在海边捡到一个漂流瓶，<br />透明干净的瓶身，深棕褐色的木塞，湿湿的。<br />应该是从很远很远的地方来的吧，<br />阿狸看了看远方。<br />在这里，冬天的海是结冰的，<br />仿佛时间是停顿的。<br />小小的漂流瓶啊，你来自什么地方？<br />是来自漂流瓶的王国吗？<br />每天都会有成百上千个漂流瓶流向不同的方向？<br />是来自失落的梦之城吗？<br />那里的金色大镜子能不能依然记得我？<br />是来自狮子座吗？<br />也许真的有漂流瓶的流星群，于是你落到了这个地方。<br />是来自守望的苏米吗？<br />有他的忘记还是寄望？<br />小小的漂流瓶啊 ，告诉我，你是来自什么地方？<br />漂流瓶没有说话，他透明干净的瓶身反射着温暖的光。<br />---------------------------------------------------------<br />阿狸家的海，精灵语叫做 UYDE'eo，意寓 冰封之心。<br />每年的十一月最后的一缕阳光沉没的时候，<br />无尽的海变会瞬间冻结，即便是最小的浪花。<br />直到明年的春天。</p>";
        var iccc15 = "<p>阿狸你说晚上在温暖的被窝里睡觉，你最不想做的事情是什么？<br /> “尿床吧...你呢？”<br /> “......”</p>";
        var iccc16 = "<p>冬天的时候，桃子写信给阿狸说：9426464，<br />阿狸一直不明白是什么意思。<br />很久之后，<br />直到用彼得叔叔发报机的时候，<br />阿狸发现密码的意思是说<br />想你。..........................嗯，有人能听懂吗..</p>";
        var iccc17 = "<p>阿狸有一个很伟大的想法，<br />于是他千辛万苦找寒冰之心地下王国的魔法师帮他实现。<br />这是什么样子的想法呢？<br />是这样的，<br />阿狸期望有一种魔法，能用魔法做出一种吸管，<br />插在书里，就能把书当成柚子饮料一样喝完，<br />知识也就学会了。<br />所以，阿狸获得了魔法师协会土豆豆蛋士大奖。<br />在说获奖感言的时候，<br />阿狸一直憋着没好意思说其实他妈妈让他图书馆看书但是他一点也不喜欢看书但是他很喜欢喝柚子饮料所以才想出来的那样的想法。</p>";
        var iccc18 = "<p>礼拜日阿狸一般是不出门的，<br />为什么呢？<br />因为阿狸只有六条内裤，<br />它们分别叫：<br />monday<br />tuesday<br />wednesday<br />thursday<br />friday和saturday。<br />所以周日就是阿狸在家洗内裤，然后坐在沙发上，看着院子晾着的内裤晒干的日子。</p>";
        var iccc19 = "<p>摩天轮，<br />好像维持世界运转的巨大齿轮，<br />仿佛它停转，<br />世界就不在自转了。</p>";
        var iccc20 = "<p>离奇的独角兽最早的独角兽出现在希伯来人的《圣经.旧约》中，<br />这种额头长有一只角的马叫做 're'em'，最初被译作'monokeros'，后来才演变成英文中的'unicorn'。　　传说中的独角兽是个优美的生物，是一匹周身雪白的小马，灵活敏捷，前额有一只充满魔力的角。它有时被描绘成雌性的，温顺谦和。传说中 在彩虹的尽头，神秘梦幻的国度中，有一只为了追寻真爱勇往直前的独角兽...-纯真而害羞，善良而勇敢，梦幻而神秘，一只奔驰在森林中稀有的独角兽......</p>";
        var iccc21 = "<p>如果海会说话<br />如果风爱上砂<br />如果有些想念<br />遗忘在漫长的长假<br />我会聆听浪花<br />让风吹过头发<br />任记忆里的爱情<br />在时间潮汐里喧哗<br />非得等春天远了夏天才近了<br />我是在回首时终于懂得<br />当阳光 再次<br />回到那飘着雨的国境之南<br />我会试着把那一年的故事<br />再接下去说完<br />当阳光 再次<br />离开那太晴朗的国境之南<br />你会不会把你曾带走的爱<br />在告别前用微笑全归还<br />海很蓝 星光灿烂<br />我仍空着我的臂弯<br />天很宽 在我独自唱歌的夜晚<br />请原谅我的爱诉说的太缓慢<br />当阳光 再次<br />回到那飘着雨的国境之南<br />我会试着把那一年的故事<br />再接下去说完<br />阳光 再次<br />离开那太晴朗的国境之南<br />你会不会把你曾带走的爱<br />在告别前用微笑全归还    ---《国境之南》.范逸臣</p>";
        var iccc22 = "<p>和你打电话的时候，你长长的那声“wei~~~~”听起来好像“woaini~~”</p>";
        var iccc23 = "<p>忽然发现有红色的星， 到海边看到有人在放红色的孔明灯，越飞越高越飞越高，最后变成了一颗暗红色的星</p>";
        var iccc24 = "<p>我很讨厌化学，比如那些复杂的方程式。'<br />'可是，你知道吗？在化学中所有物质都不会消失，而只会转化。' 我忽然觉得如果生活也是这样就好了。</p>";
        var iccc25 = "<p>秋天小镇边开满了红色的花，像凝固的血等待冬天的降临 <br />每当这个季节，阿狸总喜欢走在小镇厚厚的落叶上好像漂浮在金黄色的海洋 阿狸发现地上有一颗花的种子种子躲在叶子下是等待死亡？还是等待萌芽？<br /> 阿狸把种子捡起来，带到外婆家隔壁的花房，<br />老花匠米兰从阿狸的手里接过种子戴上花镜看了一下说：这是彼岸花的种子。 <br />彼岸花？是什么样子的花？ <br />很久很久以前，布鲁特王国的边缘开满了大片大片的彼岸花， <br />曼珠是彼岸花的花妖，沙华是彼岸花的叶精。无论是黑夜还是光明，是冬天还是夏天是寂寞还是喧嚣他们都相守一起都安静绽开， 一眼望去，漫山遍野的红色，红的耀眼，红的绚烂整个世界都是花的芬芳。 传说神也无比的怜爱彼岸花，生怕受诸神的侵扰于是命两个妖精永世轮流守护这株受神青睐的花。曼珠在白昼，沙华在夜晚，<br />从此他们就这样分离。<br />曼珠从未想象就这样就和沙华永别沙华总幻想有一天他们会再次相遇。 曼珠在雨天的时候会觉得孤单<br />沙华在黄昏的时候会分外想念<br />曼珠给沙华写的信被大风吹走<br />沙华留曼珠的口信淹没在人海<br />有时候曼珠会怀疑是否真的有沙华存在过<br />有时候沙华会恍惚曼珠是否只是昨晚的梦<br />曼珠坐在花朵上看着星空找沙华的星座<br />沙华躺在叶子上沉浸在萤火虫的星空默念曼珠的名字<br />曼珠在蓝色的树梢上，在想此刻他是否也会这样思念她？<br />沙华在黑色的树洞里，在想此时她是否也会这样想念他？ 曼珠在回忆他的昨天，沙华在回想她的从前<br />他们看同一个太阳，一个是夕阳，一个是朝阳<br />他们看同一个月亮，一个是白色一面，一个是黑暗的背影<br />他们闻同一朵玫瑰，一个是差一个花瓣未开的玫瑰，一个是刚谢了一个花瓣的玫瑰<br />曼珠和沙华默默看着时针分针秒针，等待自己消失对方出现的时刻<br />他们的距离是如此的近，甚至都能感觉到彼此刚离去的体温，但是却终见不到<br />他们在同一个时间，却存在不同的世界 <br />他们在同一个世界，却忙碌于各自的时间。 <br />一年过去了，十年过去了，几个世纪过去了，几千光年过去了。<br /> 他们是守候了几千年的彼岸花，知道彼此的存在，却未曾再谋面。 <br />他们很难过的想念着彼此。 <br />终于有一天，他们决定违背神的规定偷偷地见一次面。 那天世界变得安静，除了火红色的彼岸花开的声音。 红色从山谷一直蔓延到天空， 银河是红色的。 月亮是红色的。 阿尔卑斯山是红色的。 雪是红色的。<br />将一整个灰白世界染成鲜红一片，每一步都仿佛照耀着路的尽头。 直到世界终于被融化。<br />神总是无所不知，后来神怪罪下来，这也是意料之中的．<br />于是，曼珠和沙华被打入地狱，并被诅咒永远也不能在一起，生生世世在人间受到磨难。 自此花语变成是“分离与伤心”。从那以后，彼岸花便开在冥界河边、忘川彼岸的接引之花。花如血一样绚烂鲜红，且有花无叶，是冥界唯一的花。花香传说有魔力，能唤起死者生前的记忆。在冥界上大批大批的开着这花，远远看上去就像是血所铺成的地毯, 就好像火照之路。这也是也是幽暗的冥界唯一的色彩与生命，给人温暖。<br />后来的后来，阿狸的那颗彼岸花的种子，却未曾种下，<br />他想让花和叶永远幸福的相守在小小的种子里。离开那悲伤的轮回。<br />在梦里，阿狸看到彼岸花的红艳艳的花被惹眼的绿色衬托着，天使般美丽。<br />.........................................................................<br /></p>";
        var iccc26 = "<p>话剧结尾的时候，<br />马路把明明抢回家绑在椅子上，<br />跪下哭着对她说：<br />明明,我想给你一切,可我一无所有,我想为你放弃一切,可我又没有什么可以放弃<br />钱,地位,荣耀,我仅有的那一点点自尊没有这些东西装点也就不值一提<br />如果是中世纪,我可以去做一个骑士,把你的名字写上每一座被征服的城池<br />如果在荒漠中,我会流尽最后一滴鲜血去滋润你干裂的嘴唇<br />如果我是天文学家,有一颗星星会叫做明明<br />如果我是诗人,所有的声音都只为你歌唱<br />如果我是法官,你的好恶就是我最高的法则<br />如果我是神父,再没有比你更好的天堂<br />如果我是一个哨兵,你的每一个字都是我的口令<br />如果我是西楚霸王,我会带你临阵脱逃任由人们耻笑<br />如果我是杀人如麻的强盗,他们会乞求你来让我俯首帖耳<br />可我什么也不是,一个普通人,一个像我这样普通的人<br />我能为你做什么呢?<br />在明明面前变得卑微的马路，<br />在爱情面前变得懦弱和妥协的马路，<br />在爱人面前变得痴狂和执着的马路，<br />在很多人眼里已经变得不可理喻和不可思议。<br />在这个物质过剩的时代<br />在这个诱惑过剩的时代<br />执着不见得是一个好事，<br />但是却已经确确实实的变成了一件奢侈品。<br />..........................................................................<br /></p>";
        var iccc27 = "<p>理想，是一个动词，<br />妈妈说，实现理想很简单，<br />2点就好，一个方向对，另外一个是努力。<br />后来我发现其实是很难。<br />就好像做一个种子的过程，<br />总要经历想开花的浮躁和漫长的寂寞。<br />阿狸，你看，大人的很多事情总是说起来容易，做起来辛苦。<br />理想一开始很美好，<br />然后渐渐变得不再浪漫，<br />到最后变成了责任。<br />我觉得，有了责任便会坚持的更久一些吧，会走的更远吧.....<br />我从来不觉得你是虚拟，<br />总是觉得你坐我的肩上看我做事情。<br />阿狸，你要知道，世界上再没有人比我更爱你。</p>";
        var iccc28 = "<p>How to train your dragon<br />阿狸用了半年的时间，终于找到了传说中的“夜之震怒”，Night Fury。<br />然后用整整几个月的时间驯服了他，在阿狸眼里这是多么伟大的一件事情呀！<br />而阿狸在晚上听到它的呼噜声，<br />终于明白为什么它叫“夜之震怒”了。</p>";
        var iccc29 = "<p>关于小白<br />阿狸有一个脾气很好的朋友小白。<br />阿狸：你发脾气会什么样子呢？<br />小白：这个....我也说不好啊<br />阿狸：发一个我看看吧！发吧发吧发吧！<br />小白：你这个要求很欠扁哎！<br />阿狸：会不会想摔东西呢?我有时候就会！....比如摔这个镜子<br />小白：太重了。<br />阿狸：那摔这只笔吧！<br />小白：我就剩这一只出水的笔了。<br />阿狸：...............<br />小白：...............<br />阿狸：那摔这张用过的纸好了吧！！<br />后来阿狸就看到小白郑重其事的把那张纸放平，叠成了纸飞机。<br />然后用力扔出了窗外。<br />阿狸：...............<br />.........................................................................<br />关于爱情<br />阿狸一边舔冰棍一边看着路边的恋人想：<br />谈恋爱的感觉是不是和吃冰棍一样甜呢？<br />还没想完，<br />突然绊了一下。<br />冰棍就掉沟里面了。<br />.........................................................................<br />关于生活<br />无论生活有多复杂，<br />我们要做的是接受，并勇于面对。<br />........................................................................<br />关于静谧<br />你是使用了魔法了吧？<br />因此这个世界和沙漠一般的静谧<br />听不到别人的对话和诽谤<br />听不到城镇的钟声和喧嚣，<br />听不到怀疑和虚伪<br />听不到懦弱和逃避<br />为什么要让一切的声音消失？<br />你告诉我只为了让你的心跳声<br />能让我听到。<br />..........................................................................<br />送给所有关注阿狸的朋友。送给所有相信童话的人。<br />送给我自己。<br /></p>"

        var story1 = "<p>“每天早上看见你和阳光都在，就是我想要的未来。”阿狸说，“没有一个人,内心强大到可以接受一次次的伤害。所以,如果你是爱我的,请忘了我的坚强。多希望你能明白我，即使我什么都没说。”</p>";
        var story2 = "<p>阿狸妈妈让阿狸洗衣服，<br />阿狸就把他所有的脏衣服放在一个大盆里泡着，<br />自已在旁边坐着，<br />注视着盆子里的衣服说了句：“亲，自己洗个澡吧！”</p>";
        var story3 = "<p>医生艾伦：大熊，你哪里不舒服。<br />大熊：我吃撑了！<br />医生艾伦：怎么回事？<br />大熊：我吃完晚饭之后就去洗澡，结果洗完之后忘记已经吃过晚饭了，又去吃了一次。<br />医生艾伦：。。。。</p>";
        var story4 = "<p>阿狸：“你看吧，桃子想说做车模，你就点头就好了，还补充说她最适合做手推车车模，现在后悔说了吧。”<br />米卡：“。。。。。”</p>";
        var story5 = "<p>阿狸给桃子买了一瓶矿泉水，<br />阿狸：“我来帮你打开吧。。。哎？。。。。”<br />大熊：“。。。。”<br />影子：“。。。。”<br />影子：“桃子你看那边！”<br />桃子：“啊？”<br />大熊悄悄说：“影子在给你争取时间，你倒是快点拧啊，就你点小劲还帮桃子拧矿泉水啊！”</p>";
        var story6 = "<p>硝烟弥漫的战场上，<br />士兵：“攻击攻击！！……阿狸！大熊！影子！我是让你们攻击！！！不是让你们装公鸡！！！”</p>";
        var story7 = "<p>影子：“阿狸怎么了？”<br />大熊：“受到了前所未有的打击。”<br />影子：“什么打击？”<br />大熊：“他一直以为桃子对他说的是爱你，今天才知道人家说的其实是矮狸。”<br />影子：“。。。。”</p>";
        var story8 = "<p>下午时候，阿狸和大熊、影子一起打牌，到了决一胜负的关键时刻！<br />阿狸诚心祈祷说：“请万能的神赐予我一张好牌吧！！！”<br />结果打开的下一张牌，上面写着：“好牌！”</p>";
        var story9 = "<p>阿狸：“大熊，你看我的造型怎么样！”<br />大熊：“别人是造型，你这是造！”<br />阿狸：“。。。。”</p>";
        var story10 = "<p>看完了《地心旅行记》之后，<br />阿狸决定要去很远的地方旅行！<br />结果他走过了几个街区，买了一个甜筒就回来了。。。</p>";
        var story11 = "<p>阿狸和伙伴们春游结果在翡翠森林里迷路了。<br />“米卡！！旅行之前让你带个地图，结果你带了个地球仪有个P用啊！！”</p>";
        var story12 = "<p>“阿狸，想不想吃草莓？”<br />“想！”<br />“那你自己去洗下。”<br />“那不吃了。”<br />“。。。。。”</p>";
        var story13 = "<p>吃过鸡肉卷的有没有！！<br />吃过鸡肉卷的有没有！！<br />吃过鸡肉卷的有没有！！<br />这个可以有！<br />这个真的有！<br />这个经常有！<br />喜欢吃鸡肉卷的孩子上辈子都是折翼的天使啊！！！<br />想天天吃顿顿吃各种做法鸡肉卷的有没有！！！<br />有没有！！有没有！！<br />喜欢吃鸡肉卷的孩子你们伤不起！！！！<br />“影子，阿狸怎么了？”<br />“没什么。。。他要提议午餐便当增加鸡肉卷，所以正在练习演讲。”</p>";
        var story14 = "<p>阿狸爸爸在洗碗的时候说：当时我和你表白的时候，你的回答让我很开心。<br />阿狸妈妈：“哎？我回答什么了。”<br />阿狸爸爸：“我问你，你爱我吗？你回答说爱啊。”<br />阿狸妈妈：“啊，我没有听到你问我啊，我当时说的是哎呀。”<br />阿狸爸爸：“。。。”</p>";
        var story15 = "<p>兔子米卡对阿狸大熊说：“我给你们变个魔术吧！”<br />米卡突然掀起礼帽上的魔术手巾，<br />“看！还会动的幸运兔脚！！”<br />“这是你自己的脚吧”阿狸说。。。</p>";
        var story16 = "<p>灯神：“是你召唤我出来的？我可以满足你三个愿望，你要感谢我。”<br />阿狸：“满足我的愿望也是你的愿望啊，你也要感谢我的~”<br />灯神：“。。。。。”</p>";
        var story17 = "<p>“阿狸，你说如果我被大魔王捉住了，你会不会成为理想中的骑士，骑白马去救我？”<br />“不会啊，我的理想是做大魔王，这样可以抓公主。”<br />啪！</p>";
        var story18 = "<p>“大熊这个门我们进不去！！”<br />“啊？你只要喊芝麻开门就好了啊”<br />“我知道啊，但是这个门是阿拉伯的，你说中文它听不懂的啦！”</p>";
        var story19 = "<p>“你好，请问让人鱼公主的鱼尾变成双腿的药水，是您配的吗？”<br />“是的，你找我有什么事情吗”<br />“是这样，能不能给我一些药水？”<br />“怎么？你也遇到了人鱼公主的遭遇？”<br />“没有，我想吃虾的时候蘸着吃，这样就能吃到两条虾尾巴了。。”</p>";
        var story20 = "<p>阿狸和小木偶参加考试。<br />考到一半，<br />听到旁边的小木偶悄悄的自言自语说：<br />这道题A是对的！！<br />说完他的鼻子就变长了，<br />然后又说：<br />这道题B是对的！！<br />鼻子又变长了！<br />这道题C是对的！！<br />小木偶的鼻子一下子恢复了！<br />阿狸：。。。。<br />后来小木偶选择题全部都是满分。。。</p>";
        var story21 = "<p>星期天的下午，阿狸和大熊在咖啡馆里。<br />大熊：阿狸快看！兔子兔子！<br />阿狸：大惊小怪，兔子有啥好看的<br />大熊：阿狸快看！兔子兔子！<br />阿狸：不想看~<br />大熊：阿狸快看！兔子兔子！<br />阿狸：好烦啊，在哪里我看看<br />阿狸一抬头，就看到一只秃子兔子跑了过去。。。</p>";
        var story22 = "<p>影子：你在干嘛？<br />阿狸：我在尝试富兰克林做的实验，也许我会获得另外一种电流，让世界多了一种能量，或者我变成闪电侠。让世界多了一个保护神。<br />影子：我觉得你只会让世界多了一种死法。</p>";
        var story23 = "<p>在下午的咖啡馆，<br />桃子忽然想喝水<br />阿狸倒了一杯热水给了她。<br />忽然觉得水太热，怕桃子烫着，<br />阿狸便换了一杯凉水给她。<br />又觉得水太凉。<br />于是，阿狸便倒了一杯热水，<br />又把从冰箱取来的一颗冰块放了进去。<br />一杯盛满温馨的水</p>";
        var story24 = "<p>大熊对阿狸说：我暗恋一个女生了。<br />阿狸：啊，是谁啊<br />大熊：是一个叫蜂蜜的女生<br />阿狸：。。。<br />恰好那个女生从他们面前经过，<br />阿狸大声喊说：<br />“蜂蜜！大熊暗恋你！！”<br />至于后来结果怎样呢？我也不知道。</p>";
        var story25 = "<p>这是我的爱，收下吧。这是我的心，别打碎了。这是我的手，握好了。我们一起，开向永远站。如果你能解释为什么会喜欢一个人，那么这不是爱情，真正的爱情没有原因，我爱你，不知道为什么。</p>";

        var iccc0 = "<p>阿狸，卡通形象，由清华大学美术学院视觉传达专业硕士学位毕业的Hans所创作，其形象为一只穿着白色短裤的、红色的小狐狸。<div style='text-align: center;'><img src='/source/0.png' style='width: 200px; height: 200px;' /></div><p><br /><strong>中文名：阿狸</strong><br /><strong>外文名：Ali</strong><br /><strong>性别：男</strong><strong>作者：徐瀚</strong><br /><strong>生日：3月16日</strong><br /><strong>星座：双鱼座</strong><br /><strong>类型：狐狸</strong><br /><strong>身高：37厘米</strong><br /><strong>血型：O型</strong><br /><strong>体重：2.7kg</strong><br /><strong>性格特点：单纯、执着、认真、有点小迷糊、可爱，有时候有不切实际的小想法</strong><br /><strong>做喜欢的食物：鸡肉卷</strong><br /><strong>最喜欢的水果：柚子</strong><br /><strong>最喜欢的狐狸：桃子</strong><br /><strong>做喜欢的人：爸爸（Hans）</strong><br /><strong>好朋友：影子、大熊、米卡</strong></p></p>";
        // 这三个字符串将对占位符图像进行编码。您需要将
        // 实际数据中的 backgroundImage 属性设置为 图像的 URL。
        var darkGray = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADsQAAA7EAZUrDhsAAAANSURBVBhXY3B0cPoPAANMAcOba1BlAAAAAElFTkSuQmCC";
        var lightGray = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADsQAAA7EAZUrDhsAAAANSURBVBhXY7h4+cp/AAhpA3h+ANDKAAAAAElFTkSuQmCC";
        var mediumGray = "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADsQAAA7EAZUrDhsAAAANSURBVBhXY5g8dcZ/AAY/AsAlWFQ+AAAAAElFTkSuQmCC";

        var group1 = "/alithefox/aliwuyu/source/0-1.jpg";
        var group2 = "/alithefox/aliwuyu/source/0-2.jpg";
        var group3 = "/alithefox/aliwuyu/source/0-3.jpg";
        var group4 = "/alithefox/aliwuyu/source/0-4.jpg";
        var group5 = "/alithefox/aliwuyu/source/4-1.jpg";

        var item1 = "/alithefox/aliwuyu/source/1-1.jpg";
        var item2 = "/alithefox/aliwuyu/source/1-2.jpg";
        var item3 = "/alithefox/aliwuyu/source/1-3.jpg";
        var item4 = "/alithefox/aliwuyu/source/1-4.jpg";
        var item5 = "/alithefox/aliwuyu/source/1-5.jpg";
        var item6 = "/alithefox/aliwuyu/source/1-6.jpg";
        var item7 = "/alithefox/aliwuyu/source/1-7.jpg";
        var item8 = "/alithefox/aliwuyu/source/1-8.jpg";
        var item9 = "/alithefox/aliwuyu/source/1-9.jpg";
        var item10 = "/alithefox/aliwuyu/source/1-10.jpg";
        var item11 = "/alithefox/aliwuyu/source/1-11.jpg";
        var item12 = "/alithefox/aliwuyu/source/1-12.jpg";
        var item13 = "/alithefox/aliwuyu/source/1-13.jpg";
        var item14 = "/alithefox/aliwuyu/source/1-14.jpg";
        var item15 = "/alithefox/aliwuyu/source/1-15.jpg";
        var item16 = "/alithefox/aliwuyu/source/1-16.jpg";
        var item17 = "/alithefox/aliwuyu/source/1-17.jpg";
        var item18 = "/alithefox/aliwuyu/source/1-18.jpg";
        var item19 = "/alithefox/aliwuyu/source/1-19.jpg";
        var item20 = "/alithefox/aliwuyu/source/1-20.jpg";
        var item21 = "/alithefox/aliwuyu/source/1-21.jpg";
        var item22 = "/alithefox/aliwuyu/source/1-22.jpg";
        var item23 = "/alithefox/aliwuyu/source/1-23.jpg";
        var item24 = "/alithefox/aliwuyu/source/1-24.jpg";
        var item25 = "/alithefox/aliwuyu/source/1-25.jpg";
        var item26 = "/alithefox/aliwuyu/source/1-26.jpg";
        var item27 = "/alithefox/aliwuyu/source/1-27.jpg";
        var item28 = "/alithefox/aliwuyu/source/1-28.jpg";
        var item29 = "/alithefox/aliwuyu/source/1-29.jpg";
        var item30 = "/alithefox/aliwuyu/source/1-30.jpg";
        var item31 = "/alithefox/aliwuyu/source/1-31.jpg";
        var item32 = "/alithefox/aliwuyu/source/1-32.jpg";
        var item33 = "/alithefox/aliwuyu/source/1-33.jpg";
        var item34 = "/alithefox/aliwuyu/source/1-34.jpg";
        var item35 = "/alithefox/aliwuyu/source/1-35.gif";
        var item36 = "/alithefox/aliwuyu/source/1-36.jpg";
        var item37 = "/alithefox/aliwuyu/source/1-37.jpg";
        var item38 = "/alithefox/aliwuyu/source/1-38.jpg";
        var item39 = "/alithefox/aliwuyu/source/1-39.jpg";
        var item40 = "/alithefox/aliwuyu/source/1-40.jpg";
        var item41 = "/alithefox/aliwuyu/source/1-41.jpg";
        var item42 = "/alithefox/aliwuyu/source/1-42.jpg";
        var item43 = "/alithefox/aliwuyu/source/1-43.jpg";
        var item44 = "/alithefox/aliwuyu/source/1-44.jpg";
        var item45 = "/alithefox/aliwuyu/source/1-45.jpg";
        var item46 = "/alithefox/aliwuyu/source/1-46.jpg";
        var item47 = "/alithefox/aliwuyu/source/1-47.jpg";
        var item48 = "/alithefox/aliwuyu/source/1-48.jpg";
        var item49 = "/alithefox/aliwuyu/source/1-49.jpg";
        var item50 = "/alithefox/aliwuyu/source/1-50.jpg";
        var item51 = "/alithefox/aliwuyu/source/1-51.jpg";
        var item52 = "/alithefox/aliwuyu/source/1-52.jpg";
        var item53 = "/alithefox/aliwuyu/source/1-53.jpg";
        var item54 = "/alithefox/aliwuyu/source/1-54.jpg";
        var item55 = "/alithefox/aliwuyu/source/1-55.jpg";
        var item56 = "/alithefox/aliwuyu/source/1-56.jpg";
        var item57 = "/alithefox/aliwuyu/source/1-57.jpg";
        var item58 = "/alithefox/aliwuyu/source/1-58.jpg";
        var item59 = "/alithefox/aliwuyu/source/1-59.jpg";
        var item60 = "/alithefox/aliwuyu/source/1-60.jpg";
        var item61 = "/alithefox/aliwuyu/source/1-61.jpg";
        var item62 = "/alithefox/aliwuyu/source/1-62.jpg";
        var item63 = "/alithefox/aliwuyu/source/1-63.jpg";
        var item64 = "/alithefox/aliwuyu/source/1-64.jpg";
        var item65 = "/alithefox/aliwuyu/source/1-65.jpg";
        var item66 = "/alithefox/aliwuyu/source/1-66.jpg";
        var item67 = "/alithefox/aliwuyu/source/1-67.jpg";
        var item68 = "/alithefox/aliwuyu/source/1-68.jpg";
        var item69 = "/alithefox/aliwuyu/source/1-69.jpg";
        var item70 = "/alithefox/aliwuyu/source/1-70.jpg";
        var item71 = "/alithefox/aliwuyu/source/1-71.jpg";
        var item72 = "/alithefox/aliwuyu/source/1-72.jpg";
        var item73 = "/alithefox/aliwuyu/source/1-73.jpg";
        var item74 = "/alithefox/aliwuyu/source/1-74.jpg";
        var item75 = "/alithefox/aliwuyu/source/1-75.jpg";
        var item76 = "/alithefox/aliwuyu/source/1-76.jpg";
        var item77 = "/alithefox/aliwuyu/source/1-77.jpg";
        var item78 = "/alithefox/aliwuyu/source/1-78.jpg";
        var item79 = "/alithefox/aliwuyu/source/1-79.jpg";
        var item80 = "/alithefox/aliwuyu/source/1-80.jpg";
        var item81 = "/alithefox/aliwuyu/source/1-81.jpg";
        var item82 = "/alithefox/aliwuyu/source/1-82.jpg";
        var item83 = "/alithefox/aliwuyu/source/1-83.jpg";
        var item84 = "/alithefox/aliwuyu/source/1-84.jpg";
        var item85 = "/alithefox/aliwuyu/source/1-85.jpg";
        var item86 = "/alithefox/aliwuyu/source/1-86.jpg";
        var item87 = "/alithefox/aliwuyu/source/1-87.jpg";
        var item88 = "/alithefox/aliwuyu/source/1-88.jpg";
        var item89 = "/alithefox/aliwuyu/source/1-89.jpg";
        var item90 = "/alithefox/aliwuyu/source/1-90.jpg";
        var item91 = "/alithefox/aliwuyu/source/1-91.jpg";
        var item92 = "/alithefox/aliwuyu/source/1-92.jpg";
        var item93 = "/alithefox/aliwuyu/source/1-93.jpg";
        var item94 = "/alithefox/aliwuyu/source/1-94.jpg";
        var item95 = "/alithefox/aliwuyu/source/1-95.jpg";
        var item96 = "/alithefox/aliwuyu/source/1-96.jpg";
        var item97 = "/alithefox/aliwuyu/source/1-97.jpg";
        var item98 = "/alithefox/aliwuyu/source/1-98.jpg";
        var item99 = "/alithefox/aliwuyu/source/1-99.jpg";
        var item100 = "/alithefox/aliwuyu/source/1-100.jpg";
        var item101 = "/alithefox/aliwuyu/source/1-101.jpg";
        var item102 = "/alithefox/aliwuyu/source/1-102.jpg";
        var item103 = "/alithefox/aliwuyu/source/1-103.jpg";
        var item104 = "/alithefox/aliwuyu/source/1-104.jpg";
        var item105 = "/alithefox/aliwuyu/source/1-105.jpg";
        var item106 = "/alithefox/aliwuyu/source/1-106.gif";
        var item107 = "/alithefox/aliwuyu/source/1-107.jpg";
        var item108 = "/alithefox/aliwuyu/source/1-108.jpg";
        var item109 = "/alithefox/aliwuyu/source/1-109.jpg";
        var item110 = "/alithefox/aliwuyu/source/1-110.jpg";
        var item111 = "/alithefox/aliwuyu/source/1-111.jpg";
        var item112 = "/alithefox/aliwuyu/source/1-112.jpg";
        var item113 = "/alithefox/aliwuyu/source/1-113.jpg";
        var item114 = "/alithefox/aliwuyu/source/1-114.jpg";
        var item115 = "/alithefox/aliwuyu/source/1-115.jpg";
        var item116 = "/alithefox/aliwuyu/source/1-116.gif";
        var item117 = "/alithefox/aliwuyu/source/1-117.jpg";
        var item118 = "/alithefox/aliwuyu/source/1-118.jpg";
        var item119 = "/alithefox/aliwuyu/source/1-119.gif";
        var item120 = "/alithefox/aliwuyu/source/1-120.jpg";
        var item121 = "/alithefox/aliwuyu/source/1-121.jpg";
        var item122 = "/alithefox/aliwuyu/source/1-122.jpg";
        var item123 = "/alithefox/aliwuyu/source/1-123.jpg";
        var item124 = "/alithefox/aliwuyu/source/1-124.jpg";
        var item125 = "/alithefox/aliwuyu/source/1-125.jpg";
        var item126 = "/alithefox/aliwuyu/source/1-126.jpg";
        var item127 = "/alithefox/aliwuyu/source/1-127.jpg";
        var item128 = "/alithefox/aliwuyu/source/1-128.jpg";
        var item129 = "/alithefox/aliwuyu/source/1-129.jpg";
        var item130 = "/alithefox/aliwuyu/source/1-130.jpg";
        var item131 = "/alithefox/aliwuyu/source/1-131.jpg";
        var item132 = "/alithefox/aliwuyu/source/1-132.jpg";
        var item133 = "/alithefox/aliwuyu/source/1-133.jpg";
        var item134 = "/alithefox/aliwuyu/source/1-134.jpg";
        var item135 = "/alithefox/aliwuyu/source/1-135.jpg";
        var item136 = "/alithefox/aliwuyu/source/1-136.jpg";
        var item137 = "/alithefox/aliwuyu/source/1-137.jpg";
        var item138 = "/alithefox/aliwuyu/source/1-138.jpg";
        var item139 = "/alithefox/aliwuyu/source/1-139.jpg";
        var item140 = "/alithefox/aliwuyu/source/1-140.jpg";
        var item141 = "/alithefox/aliwuyu/source/1-141.jpg";
        var item142 = "/alithefox/aliwuyu/source/1-142.jpg";
        var item143 = "/alithefox/aliwuyu/source/1-143.jpg";
        var item144 = "/alithefox/aliwuyu/source/1-144.jpg";
        var item145 = "/alithefox/aliwuyu/source/1-145.jpg";
        var item146 = "/alithefox/aliwuyu/source/1-146.jpg";
        var item147 = "/alithefox/aliwuyu/source/1-147.jpg";
        var item148 = "/alithefox/aliwuyu/source/1-148.jpg";
        var item149 = "/alithefox/aliwuyu/source/1-149.jpg";
        var item150 = "/alithefox/aliwuyu/source/1-150.jpg";

        var ite1 = "/alithefox/aliwuyu/source/2-1.jpg";
        var ite2 = "/alithefox/aliwuyu/source/2-2.jpg";
        var ite3 = "/alithefox/aliwuyu/source/2-3.jpg";
        var ite4 = "/alithefox/aliwuyu/source/2-4.jpg";
        var ite5 = "/alithefox/aliwuyu/source/2-5.jpg";
        var ite6 = "/alithefox/aliwuyu/source/2-6.jpg";
        var ite7 = "/alithefox/aliwuyu/source/2-7.jpg";
        var ite8 = "/alithefox/aliwuyu/source/2-8.jpg";
        var ite9 = "/alithefox/aliwuyu/source/2-9.jpg";
        var ite10 = "/alithefox/aliwuyu/source/2-10.jpg";
        var ite11 = "/alithefox/aliwuyu/source/2-11.jpg";
        var ite12 = "/alithefox/aliwuyu/source/2-12.jpg";
        var ite13 = "/alithefox/aliwuyu/source/2-13.jpg";
        var ite14 = "/alithefox/aliwuyu/source/2-14.jpg";
        var ite15 = "/alithefox/aliwuyu/source/2-15.jpg";
        var ite16 = "/alithefox/aliwuyu/source/2-16.jpg";
        var ite17 = "/alithefox/aliwuyu/source/2-17.jpg";
        var ite18 = "/alithefox/aliwuyu/source/2-18.jpg";
        var ite19 = "/alithefox/aliwuyu/source/2-19.jpg";
        var ite20 = "/alithefox/aliwuyu/source/2-20.jpg";
        var ite21 = "/alithefox/aliwuyu/source/2-21.jpg";
        var ite22 = "/alithefox/aliwuyu/source/2-22.jpg";
        var ite23 = "/alithefox/aliwuyu/source/2-23.jpg";
        var ite24 = "/alithefox/aliwuyu/source/2-24.jpg";
        var ite25 = "/alithefox/aliwuyu/source/2-25.jpg";
        var ite26 = "/alithefox/aliwuyu/source/2-26.jpg";
        var ite27 = "/alithefox/aliwuyu/source/2-27.jpg";
        var ite28 = "/alithefox/aliwuyu/source/2-28.jpg";
        var ite29 = "/alithefox/aliwuyu/source/2-29.jpg";
        var ite30 = "/alithefox/aliwuyu/source/2-30.jpg";
        var ite31 = "/alithefox/aliwuyu/source/2-31.jpg";
        var ite32 = "/alithefox/aliwuyu/source/2-32.jpg";

        var it1 = "/alithefox/aliwuyu/source/3-1.jpg";
        var it2 = "/alithefox/aliwuyu/source/3-2.jpg";
        var it3 = "/alithefox/aliwuyu/source/3-3.jpg";
        var it4 = "/alithefox/aliwuyu/source/3-4.jpg";
        var it5 = "/alithefox/aliwuyu/source/3-5.jpg";
        var it6 = "/alithefox/aliwuyu/source/3-6.jpg";
        var it7 = "/alithefox/aliwuyu/source/3-7.jpg";
        var it8 = "/alithefox/aliwuyu/source/3-8.jpg";
        var it9 = "/alithefox/aliwuyu/source/3-9.jpg";
        var it10 = "/alithefox/aliwuyu/source/3-10.jpg";
        var it11 = "/alithefox/aliwuyu/source/3-11.jpg";
        var it12 = "/alithefox/aliwuyu/source/3-12.jpg";
        var it13 = "/alithefox/aliwuyu/source/3-13.jpg";
        var it14 = "/alithefox/aliwuyu/source/3-14.jpg";
        var it15 = "/alithefox/aliwuyu/source/3-15.jpg";
        var it16 = "/alithefox/aliwuyu/source/3-16.jpg";
        var it17 = "/alithefox/aliwuyu/source/3-17.jpg";
        var it18 = "/alithefox/aliwuyu/source/3-18.jpg";
        var it19 = "/alithefox/aliwuyu/source/3-19.jpg";
        var it20 = "/alithefox/aliwuyu/source/3-20.jpg";
        var it21 = "/alithefox/aliwuyu/source/3-21.jpg";
        var it22 = "/alithefox/aliwuyu/source/3-22.jpg";
        var it23 = "/alithefox/aliwuyu/source/3-23.jpg";
        var it24 = "/alithefox/aliwuyu/source/3-24.jpg";
        var it25 = "/alithefox/aliwuyu/source/3-25.jpg";
        var it26 = "/alithefox/aliwuyu/source/3-26.jpg";
        var it27 = "/alithefox/aliwuyu/source/3-27.jpg";
        var it28 = "/alithefox/aliwuyu/source/3-28.jpg";
        var it29 = "/alithefox/aliwuyu/source/3-29.jpg";

        var st1 = "/alithefox/aliwuyu/source/5-1.jpg";
        var st2 = "/alithefox/aliwuyu/source/5-2.jpg";
        var st3 = "/alithefox/aliwuyu/source/5-3.jpg";
        var st4 = "/alithefox/aliwuyu/source/5-4.jpg";
        var st5 = "/alithefox/aliwuyu/source/5-5.jpg";
        var st6 = "/alithefox/aliwuyu/source/5-6.jpg";
        var st7 = "/alithefox/aliwuyu/source/5-7.jpg";
        var st8 = "/alithefox/aliwuyu/source/5-8.jpg";
        var st9 = "/alithefox/aliwuyu/source/5-9.jpg";
        var st10 = "/alithefox/aliwuyu/source/5-10.jpg";
        var st11 = "/alithefox/aliwuyu/source/5-11.jpg";
        var st12 = "/alithefox/aliwuyu/source/5-12.jpg";
        var st13 = "/alithefox/aliwuyu/source/5-13.jpg";
        var st14 = "/alithefox/aliwuyu/source/5-14.jpg";
        var st15 = "/alithefox/aliwuyu/source/5-15.jpg";
        var st16 = "/alithefox/aliwuyu/source/5-16.jpg";
        var st17 = "/alithefox/aliwuyu/source/5-17.jpg";
        var st18 = "/alithefox/aliwuyu/source/5-18.jpg";
        var st19 = "/alithefox/aliwuyu/source/5-19.jpg";
        var st20 = "/alithefox/aliwuyu/source/5-20.jpg";
        var st21 = "/alithefox/aliwuyu/source/5-21.jpg";
        var st22 = "/alithefox/aliwuyu/source/5-22.jpg";
        var st23 = "/alithefox/aliwuyu/source/5-23.jpg";
        var st24 = "/alithefox/aliwuyu/source/5-24.jpg";
        var st25 = "/alithefox/aliwuyu/source/5-25.jpg";

        // 这些示例组中的每个组都必须具有一个将单独显示的
        // 唯一键。
        var sampleGroups = [
            { key: "group1", title: "阿狸的999封情书", subtitle: gd1, backgroundImage: group1, description: gd1 },
            { key: "group2", title: "阿狸呓语", subtitle: gd2, backgroundImage: group2, description: gd2 },
            { key: "group3", title: "阿狸故事集", subtitle: gd3, backgroundImage: group3, description: gd3 },
            { key: "group4", title: "阿狸小小笑话", subtitle: gd4, backgroundImage: group4, description: gd4 },
            { key: "group5", title: "我是阿狸", subtitle: gd5, backgroundImage: group5, description: gd5 }
        ];

        // 这些示例项的每个项都应具有对特定组的
        // 引用。
        var sampleItems = [
            { group: sampleGroups[0], title: "《第一封》", subtitle: "", description: "", content: ic1, backgroundImage: item1 },
            { group: sampleGroups[0], title: "《第二封》", subtitle: "", description: "", content: ic2, backgroundImage: item2 },
            { group: sampleGroups[0], title: "《第三封》", subtitle: "", description: "", content: ic3, backgroundImage: item3 },
            { group: sampleGroups[0], title: "《第四封》", subtitle: "", description: "", content: ic4, backgroundImage: item4 },
            { group: sampleGroups[0], title: "《第五封》", subtitle: "", description: "", content: ic5, backgroundImage: item5 },
            { group: sampleGroups[0], title: "《第六封》", subtitle: "", description: "", content: ic6, backgroundImage: item6 },
            { group: sampleGroups[0], title: "《第七封》", subtitle: "", description: "", content: ic7, backgroundImage: item7 },
            { group: sampleGroups[0], title: "《第八封》", subtitle: "", description: "", content: ic8, backgroundImage: item8 },
            { group: sampleGroups[0], title: "《第九封》", subtitle: "", description: "", content: ic9, backgroundImage: item9 },
            { group: sampleGroups[0], title: "《第十封》", subtitle: "", description: "", content: ic10, backgroundImage: item10 },
            { group: sampleGroups[0], title: "《第十一封》", subtitle: "", description: "", content: ic11, backgroundImage: item11 },
            { group: sampleGroups[0], title: "《第十二封》", subtitle: "", description: "", content: ic12, backgroundImage: item12 },
            { group: sampleGroups[0], title: "《第十三封》", subtitle: "", description: "", content: ic13, backgroundImage: item13 },
            { group: sampleGroups[0], title: "《第十四封》", subtitle: "", description: "", content: ic14, backgroundImage: item14 },
            { group: sampleGroups[0], title: "《第十五封》", subtitle: "", description: "", content: ic15, backgroundImage: item15 },
            { group: sampleGroups[0], title: "《第十六封》", subtitle: "", description: "", content: ic16, backgroundImage: item16 },
            { group: sampleGroups[0], title: "《第十七封》", subtitle: "", description: "", content: ic17, backgroundImage: item17 },
            { group: sampleGroups[0], title: "《第十八封》", subtitle: "", description: "", content: ic18, backgroundImage: item18 },
            { group: sampleGroups[0], title: "《第十九封》", subtitle: "", description: "", content: ic19, backgroundImage: item19 },
            { group: sampleGroups[0], title: "《第二十封》", subtitle: "", description: "", content: ic20, backgroundImage: item20 },
            { group: sampleGroups[0], title: "《第二十一封》", subtitle: "", description: "", content: ic21, backgroundImage: item21 },
            { group: sampleGroups[0], title: "《第二十二封》", subtitle: "", description: "", content: ic22, backgroundImage: item22 },
            { group: sampleGroups[0], title: "《第二十三封》", subtitle: "", description: "", content: ic23, backgroundImage: item23 },
            { group: sampleGroups[0], title: "《第二十四封》", subtitle: "", description: "", content: ic24, backgroundImage: item24 },
            { group: sampleGroups[0], title: "《第二十五封》", subtitle: "", description: "", content: ic25, backgroundImage: item25 },
            { group: sampleGroups[0], title: "《第二十六封》", subtitle: "", description: "", content: ic26, backgroundImage: item26 },
            { group: sampleGroups[0], title: "《第二十七封》", subtitle: "", description: "", content: ic27, backgroundImage: item27 },
            { group: sampleGroups[0], title: "《第二十八封》", subtitle: "", description: "", content: ic28, backgroundImage: item28 },
            { group: sampleGroups[0], title: "《第二十九封》", subtitle: "", description: "", content: ic29, backgroundImage: item29 },
            { group: sampleGroups[0], title: "《第三十封》", subtitle: "", description: "", content: ic30, backgroundImage: item30 },
            { group: sampleGroups[0], title: "《第三十一封》", subtitle: "", description: "", content: ic31, backgroundImage: item31 },
            { group: sampleGroups[0], title: "《第三十二封》", subtitle: "", description: "", content: ic32, backgroundImage: item32 },
            { group: sampleGroups[0], title: "《第三十三封》", subtitle: "", description: "", content: ic33, backgroundImage: item33 },
            { group: sampleGroups[0], title: "《第三十四封》", subtitle: "", description: "", content: ic34, backgroundImage: item34 },
            { group: sampleGroups[0], title: "《第三十五封》", subtitle: "", description: "", content: ic35, backgroundImage: item35 },
            { group: sampleGroups[0], title: "《第三十六封》", subtitle: "", description: "", content: ic36, backgroundImage: item36 },
            { group: sampleGroups[0], title: "《第三十七封》", subtitle: "", description: "", content: ic37, backgroundImage: item37 },
            { group: sampleGroups[0], title: "《第三十八封》", subtitle: "", description: "", content: ic38, backgroundImage: item38 },
            { group: sampleGroups[0], title: "《第三十九封》", subtitle: "", description: "", content: ic39, backgroundImage: item39 },
            { group: sampleGroups[0], title: "《第四十封》", subtitle: "", description: "", content: ic40, backgroundImage: item40 },
            { group: sampleGroups[0], title: "《第四十一封》", subtitle: "", description: "", content: ic41, backgroundImage: item41 },
            { group: sampleGroups[0], title: "《第四十二封》", subtitle: "", description: "", content: ic42, backgroundImage: item42 },
            { group: sampleGroups[0], title: "《第四十三封》", subtitle: "", description: "", content: ic43, backgroundImage: item43 },
            { group: sampleGroups[0], title: "《第四十四封》", subtitle: "", description: "", content: ic44, backgroundImage: item44 },
            { group: sampleGroups[0], title: "《第四十五封》", subtitle: "", description: "", content: ic45, backgroundImage: item45 },
            { group: sampleGroups[0], title: "《第四十六封》", subtitle: "", description: "", content: ic46, backgroundImage: item46 },
            { group: sampleGroups[0], title: "《第四十七封》", subtitle: "", description: "", content: ic47, backgroundImage: item47 },
            { group: sampleGroups[0], title: "《第四十八封》", subtitle: "", description: "", content: ic48, backgroundImage: item48 },
            { group: sampleGroups[0], title: "《第四十九封》", subtitle: "", description: "", content: ic49, backgroundImage: item49 },
            { group: sampleGroups[0], title: "《第五十封》", subtitle: "", description: "", content: ic50, backgroundImage: item50 },
            { group: sampleGroups[0], title: "《第五十一封》", subtitle: "", description: "", content: ic51, backgroundImage: item51 },
            { group: sampleGroups[0], title: "《第五十二封》", subtitle: "", description: "", content: ic52, backgroundImage: item52 },
            { group: sampleGroups[0], title: "《第五十三封》", subtitle: "", description: "", content: ic53, backgroundImage: item53 },
            { group: sampleGroups[0], title: "《第五十四封》", subtitle: "", description: "", content: ic54, backgroundImage: item54 },
            { group: sampleGroups[0], title: "《第五十五封》", subtitle: "", description: "", content: ic55, backgroundImage: item55 },
            { group: sampleGroups[0], title: "《第五十六封》", subtitle: "", description: "", content: ic56, backgroundImage: item56 },
            { group: sampleGroups[0], title: "《第五十七封》", subtitle: "", description: "", content: ic57, backgroundImage: item57 },
            { group: sampleGroups[0], title: "《第五十八封》", subtitle: "", description: "", content: ic58, backgroundImage: item58 },
            { group: sampleGroups[0], title: "《第五十九封》", subtitle: "", description: "", content: ic59, backgroundImage: item59 },
            { group: sampleGroups[0], title: "《第六十封》", subtitle: "", description: "", content: ic60, backgroundImage: item60 },
            { group: sampleGroups[0], title: "《第六十一封》", subtitle: "", description: "", content: ic61, backgroundImage: item61 },
            { group: sampleGroups[0], title: "《第六十二封》", subtitle: "", description: "", content: ic62, backgroundImage: item62 },
            { group: sampleGroups[0], title: "《第六十三封》", subtitle: "", description: "", content: ic63, backgroundImage: item63 },
            { group: sampleGroups[0], title: "《第六十四封》", subtitle: "", description: "", content: ic64, backgroundImage: item64 },
            { group: sampleGroups[0], title: "《第六十五封》", subtitle: "", description: "", content: ic65, backgroundImage: item65 },
            { group: sampleGroups[0], title: "《第六十六封》", subtitle: "", description: "", content: ic66, backgroundImage: item66 },
            { group: sampleGroups[0], title: "《第六十七封》", subtitle: "", description: "", content: ic67, backgroundImage: item67 },
            { group: sampleGroups[0], title: "《第六十八封》", subtitle: "", description: "", content: ic68, backgroundImage: item68 },
            { group: sampleGroups[0], title: "《第六十九封》", subtitle: "", description: "", content: ic69, backgroundImage: item69 },
            { group: sampleGroups[0], title: "《第七十封》", subtitle: "", description: "", content: ic70, backgroundImage: item70 },
            { group: sampleGroups[0], title: "《第七十一封》", subtitle: "", description: "", content: ic71, backgroundImage: item71 },
            { group: sampleGroups[0], title: "《第七十二封》", subtitle: "", description: "", content: ic72, backgroundImage: item72 },
            { group: sampleGroups[0], title: "《第七十三封》", subtitle: "", description: "", content: ic73, backgroundImage: item73 },
            { group: sampleGroups[0], title: "《第七十四封》", subtitle: "", description: "", content: ic74, backgroundImage: item74 },
            { group: sampleGroups[0], title: "《第七十五封》", subtitle: "", description: "", content: ic75, backgroundImage: item75 },
            { group: sampleGroups[0], title: "《第七十六封》", subtitle: "", description: "", content: ic76, backgroundImage: item76 },
            { group: sampleGroups[0], title: "《第七十七封》", subtitle: "", description: "", content: ic77, backgroundImage: item77 },
            { group: sampleGroups[0], title: "《第七十八封》", subtitle: "", description: "", content: ic78, backgroundImage: item78 },
            { group: sampleGroups[0], title: "《第七十九封》", subtitle: "", description: "", content: ic79, backgroundImage: item79 },
            { group: sampleGroups[0], title: "《第八十封》", subtitle: "", description: "", content: ic80, backgroundImage: item80 },
            { group: sampleGroups[0], title: "《第八十一封》", subtitle: "", description: "", content: ic81, backgroundImage: item81 },
            { group: sampleGroups[0], title: "《第八十二封》", subtitle: "", description: "", content: ic82, backgroundImage: item82 },
            { group: sampleGroups[0], title: "《第八十三封》", subtitle: "", description: "", content: ic83, backgroundImage: item83 },
            { group: sampleGroups[0], title: "《第八十四封》", subtitle: "", description: "", content: ic84, backgroundImage: item84 },
            { group: sampleGroups[0], title: "《第八十五封》", subtitle: "", description: "", content: ic85, backgroundImage: item85 },
			{ group: sampleGroups[0], title: "《第八十六封》", subtitle: "", description: "", content: ic86, backgroundImage: item86 },
            { group: sampleGroups[0], title: "《第八十七封》", subtitle: "", description: "", content: ic87, backgroundImage: item87 },
            { group: sampleGroups[0], title: "《第八十八封》", subtitle: "", description: "", content: ic88, backgroundImage: item88 },
            { group: sampleGroups[0], title: "《第八十九封》", subtitle: "", description: "", content: ic89, backgroundImage: item89 },
            { group: sampleGroups[0], title: "《第九十封》", subtitle: "", description: "", content: ic90, backgroundImage: item90 },
            { group: sampleGroups[0], title: "《第九十一封》", subtitle: "", description: "", content: ic91, backgroundImage: item91 },
            { group: sampleGroups[0], title: "《第九十二封》", subtitle: "", description: "", content: ic92, backgroundImage: item92 },
            { group: sampleGroups[0], title: "《第九十三封》", subtitle: "", description: "", content: ic93, backgroundImage: item93 },
            { group: sampleGroups[0], title: "《第九十四封》", subtitle: "", description: "", content: ic94, backgroundImage: item94 },
            { group: sampleGroups[0], title: "《第九十五封》", subtitle: "", description: "", content: ic95, backgroundImage: item95 },
            { group: sampleGroups[0], title: "《第九十六封》", subtitle: "", description: "", content: ic96, backgroundImage: item96 },
            { group: sampleGroups[0], title: "《第九十七封》", subtitle: "", description: "", content: ic97, backgroundImage: item97 },
            { group: sampleGroups[0], title: "《第九十八封》", subtitle: "", description: "", content: ic98, backgroundImage: item98 },
			{ group: sampleGroups[0], title: "《第九十九封》", subtitle: "", description: "", content: ic99, backgroundImage: item99 },
            { group: sampleGroups[0], title: "《第一百封》", subtitle: "", description: "", content: ic100, backgroundImage: item100 },
            { group: sampleGroups[0], title: "《第一百零一封》", subtitle: "", description: "", content: ic101, backgroundImage: item101 },
            { group: sampleGroups[0], title: "《第一百零二封》", subtitle: "", description: "", content: ic102, backgroundImage: item102 },
            { group: sampleGroups[0], title: "《第一百零三封》", subtitle: "", description: "", content: ic103, backgroundImage: item103 },
            { group: sampleGroups[0], title: "《第一百零四封》", subtitle: "", description: "", content: ic104, backgroundImage: item104 },
            { group: sampleGroups[0], title: "《第一百零五封》", subtitle: "", description: "", content: ic105, backgroundImage: item105 },
            { group: sampleGroups[0], title: "《第一百零六封》", subtitle: "", description: "", content: ic106, backgroundImage: item106 },
            { group: sampleGroups[0], title: "《第一百零七封》", subtitle: "", description: "", content: ic107, backgroundImage: item107 },
            { group: sampleGroups[0], title: "《第一百零八封》", subtitle: "", description: "", content: ic108, backgroundImage: item108 },
		    { group: sampleGroups[0], title: "《第一百零九封》", subtitle: "", description: "", content: ic109, backgroundImage: item109 },
            { group: sampleGroups[0], title: "《第一百一十封》", subtitle: "", description: "", content: ic110, backgroundImage: item110 },
            { group: sampleGroups[0], title: "《第一百一十一封》", subtitle: "", description: "", content: ic111, backgroundImage: item111 },
            { group: sampleGroups[0], title: "《第一百一十二封》", subtitle: "", description: "", content: ic112, backgroundImage: item112 },
            { group: sampleGroups[0], title: "《第一百一十三封》", subtitle: "", description: "", content: ic113, backgroundImage: item113 },
            { group: sampleGroups[0], title: "《第一百一十四封》", subtitle: "", description: "", content: ic114, backgroundImage: item114 },
            { group: sampleGroups[0], title: "《第一百一十五封》", subtitle: "", description: "", content: ic115, backgroundImage: item115 },
            { group: sampleGroups[0], title: "《第一百一十六封》", subtitle: "", description: "", content: ic116, backgroundImage: item116 },
            { group: sampleGroups[0], title: "《第一百一十七封》", subtitle: "", description: "", content: ic117, backgroundImage: item117 },
            { group: sampleGroups[0], title: "《第一百一十八封》", subtitle: "", description: "", content: ic118, backgroundImage: item118 },
            { group: sampleGroups[0], title: "《第一百一十九封》", subtitle: "", description: "", content: ic119, backgroundImage: item119 },
            { group: sampleGroups[0], title: "《第一百二十封》", subtitle: "", description: "", content: ic120, backgroundImage: item120 },
            { group: sampleGroups[0], title: "《第一百二十一封》", subtitle: "", description: "", content: ic121, backgroundImage: item121 },
            { group: sampleGroups[0], title: "《第一百二十二封》", subtitle: "", description: "", content: ic122, backgroundImage: item122 },
            { group: sampleGroups[0], title: "《第一百二十三封》", subtitle: "", description: "", content: ic123, backgroundImage: item123 },
            { group: sampleGroups[0], title: "《第一百二十四封》", subtitle: "", description: "", content: ic124, backgroundImage: item124 },
            { group: sampleGroups[0], title: "《第一百二十五封》", subtitle: "", description: "", content: ic125, backgroundImage: item125 },
            { group: sampleGroups[0], title: "《第一百二十六封》", subtitle: "", description: "", content: ic126, backgroundImage: item126 },
            { group: sampleGroups[0], title: "《第一百二十七封》", subtitle: "", description: "", content: ic127, backgroundImage: item127 },
            { group: sampleGroups[0], title: "《第一百二十八封》", subtitle: "", description: "", content: ic128, backgroundImage: item128 },
            { group: sampleGroups[0], title: "《第一百二十九封》", subtitle: "", description: "", content: ic129, backgroundImage: item129 },
            { group: sampleGroups[0], title: "《第一百三十封》", subtitle: "", description: "", content: ic130, backgroundImage: item130 },
            { group: sampleGroups[0], title: "《第一百三十一封》", subtitle: "", description: "", content: ic131, backgroundImage: item131 },
            { group: sampleGroups[0], title: "《第一百三十二封》", subtitle: "", description: "", content: ic132, backgroundImage: item132 },
            { group: sampleGroups[0], title: "《第一百三十三封》", subtitle: "", description: "", content: ic133, backgroundImage: item133 },
            { group: sampleGroups[0], title: "《第一百三十四封》", subtitle: "", description: "", content: ic134, backgroundImage: item134 },
            { group: sampleGroups[0], title: "《第一百三十五封》", subtitle: "", description: "", content: ic135, backgroundImage: item135 },
            { group: sampleGroups[0], title: "《第一百三十六封》", subtitle: "", description: "", content: ic136, backgroundImage: item136 },
            { group: sampleGroups[0], title: "《第一百三十七封》", subtitle: "", description: "", content: ic137, backgroundImage: item137 },
            { group: sampleGroups[0], title: "《第一百三十八封》", subtitle: "", description: "", content: ic138, backgroundImage: item138 },
            { group: sampleGroups[0], title: "《第一百三十九封》", subtitle: "", description: "", content: ic139, backgroundImage: item139 },
            { group: sampleGroups[0], title: "《第一百四十封》", subtitle: "", description: "", content: ic140, backgroundImage: item140 },
            { group: sampleGroups[0], title: "《第一百四十一封》", subtitle: "", description: "", content: ic141, backgroundImage: item141 },
            { group: sampleGroups[0], title: "《第一百四十二封》", subtitle: "", description: "", content: ic142, backgroundImage: item142 },
            { group: sampleGroups[0], title: "《第一百四十三封》", subtitle: "", description: "", content: ic143, backgroundImage: item143 },
            { group: sampleGroups[0], title: "《第一百四十四封》", subtitle: "", description: "", content: ic144, backgroundImage: item144 },
            { group: sampleGroups[0], title: "《第一百四十五封》", subtitle: "", description: "", content: ic145, backgroundImage: item145 },
            { group: sampleGroups[0], title: "《第一百四十六封》", subtitle: "", description: "", content: ic146, backgroundImage: item146 },
            { group: sampleGroups[0], title: "《第一百四十七封》", subtitle: "", description: "", content: ic147, backgroundImage: item147 },
            { group: sampleGroups[0], title: "《第一百四十八封》", subtitle: "", description: "", content: ic148, backgroundImage: item148 },
            { group: sampleGroups[0], title: "《第一百四十九封》", subtitle: "", description: "", content: ic149, backgroundImage: item149 },
            { group: sampleGroups[0], title: "《第一百五十封》", subtitle: "", description: "", content: ic150, backgroundImage: item150 },



			{ group: sampleGroups[1], title: "《第一篇》", subtitle: "", description: "", content: icc1, backgroundImage: ite1 },
            { group: sampleGroups[1], title: "《第二篇》", subtitle: "", description: "", content: icc2, backgroundImage: ite2 },
            { group: sampleGroups[1], title: "《第三篇》", subtitle: "", description: "", content: icc3, backgroundImage: ite3 },
            { group: sampleGroups[1], title: "《第四篇》", subtitle: "", description: "", content: icc4, backgroundImage: ite4 },
            { group: sampleGroups[1], title: "《第五篇》", subtitle: "", description: "", content: icc5, backgroundImage: ite5 },
            { group: sampleGroups[1], title: "《第六篇》", subtitle: "", description: "", content: icc6, backgroundImage: ite6 },
            { group: sampleGroups[1], title: "《第七篇》", subtitle: "", description: "", content: icc7, backgroundImage: ite7 },
            { group: sampleGroups[1], title: "《第八篇》", subtitle: "", description: "", content: icc8, backgroundImage: ite8 },
            { group: sampleGroups[1], title: "《第九篇》", subtitle: "", description: "", content: icc9, backgroundImage: ite9 },
            { group: sampleGroups[1], title: "《第十篇》", subtitle: "", description: "", content: icc10, backgroundImage: ite10 },
            { group: sampleGroups[1], title: "《第十一篇》", subtitle: "", description: "", content: icc11, backgroundImage: ite11 },
            { group: sampleGroups[1], title: "《第十二篇》", subtitle: "", description: "", content: icc12, backgroundImage: ite12 },
            { group: sampleGroups[1], title: "《第十三篇》", subtitle: "", description: "", content: icc13, backgroundImage: ite13 },
            { group: sampleGroups[1], title: "《第十四篇》", subtitle: "", description: "", content: icc14, backgroundImage: ite14 },
            { group: sampleGroups[1], title: "《第十五篇》", subtitle: "", description: "", content: icc15, backgroundImage: ite15 },
            { group: sampleGroups[1], title: "《第十六篇》", subtitle: "", description: "", content: icc16, backgroundImage: ite16 },
            { group: sampleGroups[1], title: "《第十七篇》", subtitle: "", description: "", content: icc17, backgroundImage: ite17 },
            { group: sampleGroups[1], title: "《第十八篇》", subtitle: "", description: "", content: icc18, backgroundImage: ite18 },
            { group: sampleGroups[1], title: "《第十九篇》", subtitle: "", description: "", content: icc19, backgroundImage: ite19 },
            { group: sampleGroups[1], title: "《第二十篇》", subtitle: "", description: "", content: icc20, backgroundImage: ite20 },
            { group: sampleGroups[1], title: "《第二十一篇》", subtitle: "", description: "", content: icc21, backgroundImage: ite21 },
            { group: sampleGroups[1], title: "《第二十二篇》", subtitle: "", description: "", content: icc22, backgroundImage: ite22 },
            { group: sampleGroups[1], title: "《第二十三篇》", subtitle: "", description: "", content: icc23, backgroundImage: ite23 },
            { group: sampleGroups[1], title: "《第二十四篇》", subtitle: "", description: "", content: icc24, backgroundImage: ite24 },
            { group: sampleGroups[1], title: "《第二十五篇》", subtitle: "", description: "", content: icc25, backgroundImage: ite25 },
            { group: sampleGroups[1], title: "《第二十六篇》", subtitle: "", description: "", content: icc26, backgroundImage: ite26 },
            { group: sampleGroups[1], title: "《第二十七篇》", subtitle: "", description: "", content: icc27, backgroundImage: ite27 },
            { group: sampleGroups[1], title: "《第二十八篇》", subtitle: "", description: "", content: icc28, backgroundImage: ite28 },
            { group: sampleGroups[1], title: "《第二十九篇》", subtitle: "", description: "", content: icc29, backgroundImage: ite29 },
            { group: sampleGroups[1], title: "《第三十篇》", subtitle: "", description: "", content: icc30, backgroundImage: ite30 },
            { group: sampleGroups[1], title: "《第三十一篇》", subtitle: "", description: "", content: icc31, backgroundImage: ite31 },
            { group: sampleGroups[1], title: "《第三十二篇》", subtitle: "", description: "", content: icc32, backgroundImage: ite32 },

            { group: sampleGroups[2], title: "《你》", subtitle: "", description: "", content: iccc1, backgroundImage: it1 },
            { group: sampleGroups[2], title: "《香菜》", subtitle: "", description: "", content: iccc2, backgroundImage: it2 },
            { group: sampleGroups[2], title: "《豌豆》", subtitle: "", description: "", content: iccc3, backgroundImage: it3 },
            { group: sampleGroups[2], title: "《阿里咖啡店&糖果店》", subtitle: "", description: "", content: iccc4, backgroundImage: it4 },
            { group: sampleGroups[2], title: "《馅饼》", subtitle: "", description: "", content: iccc5, backgroundImage: it5 },
            { group: sampleGroups[2], title: "《email》", subtitle: "", description: "", content: iccc6, backgroundImage: it6 },
            { group: sampleGroups[2], title: "《作业》", subtitle: "", description: "", content: iccc7, backgroundImage: it7 },
            { group: sampleGroups[2], title: "《海豚音》", subtitle: "", description: "", content: iccc8, backgroundImage: it8 },
            { group: sampleGroups[2], title: "《简单的幸福》", subtitle: "", description: "", content: iccc9, backgroundImage: it9 },
            { group: sampleGroups[2], title: "《擅长》", subtitle: "", description: "", content: iccc10, backgroundImage: it10 },
            { group: sampleGroups[2], title: "《远方》", subtitle: "", description: "", content: iccc11, backgroundImage: it11 },
            { group: sampleGroups[2], title: "《晚安》", subtitle: "", description: "", content: iccc12, backgroundImage: it12 },
            { group: sampleGroups[2], title: "《阳光》", subtitle: "", description: "", content: iccc13, backgroundImage: it13 },
            { group: sampleGroups[2], title: "《漂流瓶》", subtitle: "", description: "", content: iccc14, backgroundImage: it14 },
            { group: sampleGroups[2], title: "《被窝》", subtitle: "", description: "", content: iccc15, backgroundImage: it15 },
            { group: sampleGroups[2], title: "《密码：9426464》", subtitle: "", description: "", content: iccc16, backgroundImage: it16 },
            { group: sampleGroups[2], title: "《土豆豆蛋士大奖》", subtitle: "", description: "", content: iccc17, backgroundImage: it17 },
            { group: sampleGroups[2], title: "《礼拜日》", subtitle: "", description: "", content: iccc18, backgroundImage: it18 },
            { group: sampleGroups[2], title: "《摩天轮》", subtitle: "", description: "", content: iccc19, backgroundImage: it19 },
            { group: sampleGroups[2], title: "《UNICORN》", subtitle: "", description: "", content: iccc20, backgroundImage: it20 },
            { group: sampleGroups[2], title: "《面朝大海，春暖花开》", subtitle: "", description: "", content: iccc21, backgroundImage: it21 },
            { group: sampleGroups[2], title: "《爱》", subtitle: "", description: "", content: iccc22, backgroundImage: it22 },
            { group: sampleGroups[2], title: "《红色的星星》", subtitle: "", description: "", content: iccc23, backgroundImage: it23 },
            { group: sampleGroups[2], title: "《化学》", subtitle: "", description: "", content: iccc24, backgroundImage: it24 },
            { group: sampleGroups[2], title: "《彼岸花》", subtitle: "", description: "", content: iccc25, backgroundImage: it25 },
            { group: sampleGroups[2], title: "《恋爱的犀牛》", subtitle: "", description: "", content: iccc26, backgroundImage: it26 },
            { group: sampleGroups[2], title: "《HANS写给阿狸的信》", subtitle: "", description: "", content: iccc27, backgroundImage: it27 },
            { group: sampleGroups[2], title: "《驯龙记》", subtitle: "", description: "", content: iccc28, backgroundImage: it28 },

            { group: sampleGroups[3], title: "引导语", subtitle: "", description: "", content: story1, backgroundImage: st1 },
            { group: sampleGroups[3], title: "《第一则》", subtitle: "", description: "", content: story2, backgroundImage: st2 },
            { group: sampleGroups[3], title: "《第二则》", subtitle: "", description: "", content: story3, backgroundImage: st3 },
            { group: sampleGroups[3], title: "《第三则》", subtitle: "", description: "", content: story4, backgroundImage: st4 },
            { group: sampleGroups[3], title: "《第四则》", subtitle: "", description: "", content: story5, backgroundImage: st5 },
            { group: sampleGroups[3], title: "《第五则》", subtitle: "", description: "", content: story6, backgroundImage: st6 },
            { group: sampleGroups[3], title: "《第六则》", subtitle: "", description: "", content: story7, backgroundImage: st7 },
            { group: sampleGroups[3], title: "《第七则》", subtitle: "", description: "", content: story8, backgroundImage: st8 },
            { group: sampleGroups[3], title: "《第八则》", subtitle: "", description: "", content: story9, backgroundImage: st9 },
            { group: sampleGroups[3], title: "《第九则》", subtitle: "", description: "", content: story10, backgroundImage: st10 },
            { group: sampleGroups[3], title: "《第十则》", subtitle: "", description: "", content: story11, backgroundImage: st11 },
            { group: sampleGroups[3], title: "《第十一则》", subtitle: "", description: "", content: story12, backgroundImage: st12 },
            { group: sampleGroups[3], title: "《第十二则》", subtitle: "", description: "", content: story13, backgroundImage: st13 },
            { group: sampleGroups[3], title: "《第十三则》", subtitle: "", description: "", content: story14, backgroundImage: st14 },
            { group: sampleGroups[3], title: "《第十四则》", subtitle: "", description: "", content: story15, backgroundImage: st15 },
            { group: sampleGroups[3], title: "《第十五则》", subtitle: "", description: "", content: story16, backgroundImage: st16 },
            { group: sampleGroups[3], title: "《第十六则》", subtitle: "", description: "", content: story17, backgroundImage: st17 },
            { group: sampleGroups[3], title: "《第十七则》", subtitle: "", description: "", content: story18, backgroundImage: st18 },
            { group: sampleGroups[3], title: "《第十八则》", subtitle: "", description: "", content: story19, backgroundImage: st19 },
            { group: sampleGroups[3], title: "《第十九则》", subtitle: "", description: "", content: story20, backgroundImage: st20 },
            { group: sampleGroups[3], title: "《第二十则》", subtitle: "", description: "", content: story21, backgroundImage: st21 },
            { group: sampleGroups[3], title: "《第二十一则》", subtitle: "", description: "", content: story22, backgroundImage: st22 },
            { group: sampleGroups[3], title: "《第二十二则》", subtitle: "", description: "", content: story23, backgroundImage: st23 },
            { group: sampleGroups[3], title: "《第二十三则》", subtitle: "", description: "", content: story24, backgroundImage: st24 },
            { group: sampleGroups[3], title: "编后语", subtitle: "", description: "", content: story25, backgroundImage: st25 },

            { group: sampleGroups[4], title: "我是阿狸", subtitle: "", description: "", content: iccc0, backgroundImage: group5 },
        ];

        return sampleItems;
    }
})();
